[
  {
    "id": "1768341388328-sg1pfxpfb",
    "title": "Cities of the Plain",
    "author": "Cormac McCarthy",
    "status": "finished",
    "coverUrl": "http://books.google.com/books/content?id=8w_LUI1pM3IC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "description": "The setting is New Mexico in 1952, where John Grady Cole and Billy Parham are working as ranch hands. To the North lie the proving grounds of Alamogordo; to the South, the twin cities of El Paso and Juarez, Mexico. Their life is made up of trail drives and horse auctions and stories told by campfire light. It is a life that is about to change forever, and John Grady and Billy both know it. The catalyst for that change appears in the form of a beautiful, ill-starred Mexican prostitute. When John Grady falls in love, Billy agrees--against his better judgment--to help him rescue the girl from her suavely brutal pimp. The ensuing events resonate with the violence and inevitability of classic tragedy",
    "pageCount": 305,
    "publishedDate": "1998",
    "genres": [
      "Fiction"
    ],
    "isbn": "9780679423904",
    "dateFinished": "2024-04-30T05:00:00.000Z",
    "rating": 3,
    "format": "book"
  },
  {
    "id": "1768341388328-gonin6pyy",
    "title": "Blood Meridian",
    "author": "Cormac McCarthy",
    "status": "finished",
    "coverUrl": "http://books.google.com/books/content?id=_2KKDQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "description": "One of The Atlantic’s “Great American Novels of the Past 100 Years,” now with a new foreword by Marlon James Widely considered one of the finest novels by a living writer, Blood Meridian is an epic tale of the violence and corruption that attended America’s westward expansion, brilliantly subverting the conventions of the Western novel and the mythology of the “Wild West.” Its wounded hero, the Kid, a fourteen-year-old Tennessean, must confront the extraordinary brutality of the Glanton gang, a murderous cadre on an official mission to scalp Indians. Seeming to preside over this nightmarish world is the diabolical Judge Holden, one of the most unforgettable characters in American fiction. Based on historical events that took place on the Texas-Mexico border in the 1850s, Blood Meridian represents a genius vision of the historical West, one whose stature has only grown in the years since its publication.",
    "pageCount": 369,
    "publishedDate": "1992-05-05",
    "genres": [
      "Fiction"
    ],
    "isbn": "9780679728757",
    "rating": 4,
    "format": "book"
  },
  {
    "id": "1768341388328-sle5l4h74",
    "title": "Desert Solitaire",
    "author": "Edward Abbey",
    "status": "finished",
    "coverUrl": "http://books.google.com/books/content?id=-oTfpSQYd4QC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "description": "“Rough, tough, combative . . . a passionately felt, deeply poetic book.”—Edwin Way Teale, The New York Times Book Review “This is not primarily a book about the desert,” writes Edward Abbey in his introduction. “In recording my impressions of the natural scene I have striven above all for accuracy, since I believe that there is a kind of poetry, even a kind of truth, in simple fact. But the desertis a vast world, an oceanic world, as deep in its way and complex and various as the sea. Language makes a mighty loose net with which to go fishing for simple facts, when facts are infinite. If a man knew enough he could write a whole book about the juniper tree. Not juniper trees in general but that one particular juniper tree which grows from a ledge of naked sandstone near the old entrance to Arches National Monument. What I have tried to do then is something a bit different. Since you cannot get the desert into a book any more than a fisherman can haul up the sea with his nets, I have tried to create a world of words in which the desert figures more as medium than as material. Not imitation but evocation has been the goal.”",
    "pageCount": 354,
    "publishedDate": "1985-01-12",
    "genres": [
      "Nature"
    ],
    "isbn": "9780345326492",
    "rating": 5,
    "format": "book"
  },
  {
    "id": "1768341388328-eyoxsh10r",
    "title": "Stiff",
    "author": "Mary Roach",
    "status": "finished",
    "coverUrl": "http://books.google.com/books/content?id=XNvkUR5mKoAC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "description": "A New York Times forensic science bestseller, \"this quirky, funny read offers perspective and insight about life, death and the medical profession.\"* For two thousand years, cadavers—some willingly, some unwittingly—have been involved in science's boldest strides and weirdest undertakings. They've tested France's first guillotines, ridden the NASA Space Shuttle, been crucified in a Parisian laboratory to test the authenticity of the Shroud of Turin, and helped solve the mystery of TWA Flight 800. For every new surgical procedure, from heart transplants to gender confirmation surgery, cadavers have helped make history in their quiet way. \"Delightful—though never disrespectful\" ( Time Out New York), science writer Mary Roach's Stiff investigates the strange lives of our bodies postmortem and answers the question: What should we do after we die? \"You can close this book with an appreciation of the miracle that the human body really is.\" —* Wall Street Journal \"Acutely entertaining, morbidly fascinating.\" — Forbes \"One of the funniest and most unusual books of the year. . . . Gross, educational, and unexpectedly sidesplitting.\" — Entertainment Weekly With an Epilogue by the Author",
    "pageCount": 305,
    "publishedDate": "2004-05-17",
    "genres": [
      "Science"
    ],
    "isbn": "9780393069198",
    "dateFinished": "2024-09-18T05:00:00.000Z",
    "rating": 2,
    "format": "audiobook"
  },
  {
    "id": "1768341388328-d4qqthazx",
    "title": "Refuge",
    "author": "Terry Tempest Williams",
    "status": "want-to-read",
    "coverUrl": "http://books.google.com/books/content?id=vcJ7PL9boTUC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "description": "In the spring of 1983 Terry Tempest Williams learned that her mother was dying of cancer. That same season, The Great Salt Lake began to rise to record heights, threatening the Bear River Migratory Bird Refuge and the herons, owls, and snowy egrets that Williams, a poet and naturalist, had come to gauge her life by. One event was nature at its most random, the other a by-product of rogue technology: Terry's mother, and Terry herself, had been exposed to the fallout of atomic bomb tests in the 1950s. As it interweaves these narratives of dying and accommodation, Refuge transforms tragedy into a document of renewal and spiritual grace, resulting in a work that has become a classic.",
    "pageCount": 337,
    "publishedDate": "1992-09-01",
    "genres": [
      "Biography & Autobiography"
    ],
    "isbn": "9780679740247",
    "format": "book"
  },
  {
    "id": "1768341388328-3mb2b6b5n",
    "title": "Riprap and Cold Mountain Poems",
    "author": "Gary Snyder",
    "status": "want-to-read",
    "coverUrl": "http://books.google.com/books/content?id=-tkREAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "description": "By any measure, Gary Snyder is one of the greatest poets in America in the last century. From his first book of poems to his latest collection of essays, his work and his example, standing between Tu Fu and Thoreau, have been influential all over the world. Riprap, his first book of poems, was published in Japan in 1959 by Origin Press, and it is the fiftieth anniversary of that groundbreaking book we celebrate with this edition. A small press reprint of that book included Snyder's translations of Han Shan's Cold Mountain Poems, perhaps the finest translations of that remarkable poet ever made into English. Reintroducing one of the twentieth century's foremost collections of poetry, this edition will please those already familiar with this work and excite a new generation of readers with its profound simplicity and spare elegance.",
    "pageCount": 48,
    "publishedDate": "2009-08-28",
    "genres": [
      "Poetry"
    ],
    "isbn": "9781582436968",
    "format": "book"
  },
  {
    "id": "1768341388328-6aqeaxo5w",
    "title": "Angle of Repose",
    "author": "Wallace Stegner",
    "status": "want-to-read",
    "coverUrl": "http://books.google.com/books/content?id=bmmMDQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "description": "An American masterpiece and iconic novel of the West by National Book Award and Pulitzer Prize winner Wallace Stegner—a deeply moving narrative of one family and the traditions of our national past. Lyman Ward is a retired professor of history, recently confined to a wheelchair by a crippling bone disease and dependant on others for his every need. Amid the chaos of 1970s counterculture he retreats to his ancestral home of Grass Valley, California, to write the biography of his grandmother: an elegant and headstrong artist and pioneer who, together with her engineer husband, made her own journey through the hardscrabble West nearly a hundred years before. In discovering her story he excavates his own, probing the shadows of his experience and the America that has come of age around him.",
    "pageCount": 674,
    "publishedDate": "2014-11-04",
    "genres": [
      "Fiction"
    ],
    "isbn": "9781101872765",
    "format": "book"
  },
  {
    "id": "1768341388328-5pg4byjhk",
    "title": "The Practice of the Wild",
    "author": "Gary Snyder",
    "status": "want-to-read",
    "coverUrl": "http://books.google.com/books/content?id=UoFoVnh5nGsC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "description": "Gary Snyder has been a major cultural force in America for five decades. Future readers will come to see this book as one of the central texts on wilderness and the interaction of nature and culture. The nine essays in The Practice of the Wild reveal why Snyder has gone on to become one of America's cultural leaders, comprehending things about our world before they were ever discussed in public. With thoughts ranging from political and spiritual matters to those regarding the environment and the art of becoming native to this continent, this collection of essays, first published in 1990, reflect the mature centerpiece of the author's work and thought.",
    "pageCount": 270,
    "publishedDate": "2010-05",
    "genres": [
      "Literary Collections"
    ],
    "isbn": "9781458756701",
    "format": "book"
  },
  {
    "id": "1768341388328-2pt76vwf5",
    "title": "The Best of Edward Abbey",
    "author": "Edward Abbey",
    "status": "abandoned",
    "coverUrl": "http://books.google.com/books/content?id=acMpAAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "description": "A mix of fiction and essays by the author described as \"the Thoreau of the American West\" (Larry McMurtry, The Washington Post). Edward Abbey himself compiled this volume representing some of his greatest work—including selections from such novels as The Monkey Wrench Gang, The Brave Cowboy, and Black Sun, as well as a number of expressive and acerbic essays. Renowned for inspiring modern environmentalists—though his interests ranged as widely as the landscapes he loved—Abbey offers an entertaining introduction to his writing, including excerpts from the autobiographical Desert Solitaire, in addition to his own sketches illustrating the text throughout.",
    "pageCount": 503,
    "publishedDate": "2011-08-21",
    "genres": [
      "Fiction"
    ],
    "isbn": "9780795317453",
    "rating": 3,
    "format": "book"
  },
  {
    "id": "1768341388328-9hma8y4c6",
    "title": "Blue Desert",
    "author": "Charles Bowdin",
    "status": "want-to-read",
    "coverUrl": "http://books.google.com/books/content?id=ELpjDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "pageCount": 222,
    "isbn": "9780816537914",
    "format": "book"
  },
  {
    "id": "1768341388328-yy3diu0hz",
    "title": "Travels with Charley",
    "author": "John Steinbeck",
    "status": "finished",
    "coverUrl": "http://books.google.com/books/content?id=Siw8DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "description": "An intimate journey across America, as told by one of its most beloved writers To hear the speech of the real America, to smell the grass and the trees, to see the colors and the light—these were John Steinbeck's goals as he set out, at the age of fifty-eight, to rediscover the country he had been writing about for so many years. With Charley, his French poodle, Steinbeck drives the interstates and the country roads, dines with truckers, encounters bears at Yellowstone and old friends in San Francisco. Along the way he reflects on the American character, racial hostility, the particular form of American loneliness he finds almost everywhere, and the unexpected kindness of strangers.",
    "pageCount": 290,
    "publishedDate": "1980-01-31",
    "genres": [
      "Travel"
    ],
    "isbn": "9780140053203",
    "dateFinished": "2024-07-28T05:00:00.000Z",
    "rating": 3,
    "format": "book"
  },
  {
    "id": "1768341388328-0djz5p9gf",
    "title": "Lonesome Dove",
    "author": "Larry McMurtry",
    "status": "finished",
    "coverUrl": "http://books.google.com/books/content?id=GXYH1C_esq0C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "description": "Two former Texas Rangers, Augustus McCrae and Woodrow Call, leave their Texas ranch to lead a cattle drive to Montana, encountering outlaws, Native Americans, and ex-loves along the way.",
    "pageCount": 864,
    "publishedDate": "1986",
    "genres": [
      "Cattle drives"
    ],
    "isbn": "9781439195260",
    "dateFinished": "2024-07-21T05:00:00.000Z",
    "rating": 5,
    "format": "book"
  },
  {
    "id": "1768341388328-p4j0mq5ri",
    "title": "A Brief History of Nearly Everything",
    "author": "Bill Bryson",
    "status": "finished",
    "coverUrl": "http://books.google.com/books/content?id=hhnIWGD5Zt0C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "description": "THE #1 NATIONAL BESTSELLER, UPDATED FOR 2025 • A wonder-filled quest to understand everything that has happened in the history of the Earth, from the Big Bang theory to the rise of civilization and beyond—revised to reflect the last two decades of scientific advancement “Brims with strange and amazing facts . . . destined to become a modern classic of science writing.”—The New York Times How did we get from being nothing at all to where we are today? How did the age of the dinosaurs eventually give way to the age of the iPhone? In this completely revised update to the international phenomenon A Short History of Nearly Everything, Bill Bryson returns to answer these questions and many more. Bryson brings a groundbreaking account of life itself to a new generation of readers, as he takes subjects often passed off as boring and incomprehensible and renders them accessible, fascinating, and outright amusing to anyone who’s ever wondered about the world around them. Introducing readers to a diverse cast of the world’s most impressive archaeologists, paleontologists, physicists, astronomers, anthropologists, and mathematicians—from their offices and laboratories to dig sites and field camps—Bryson embarks on a journey to discover answers to the biggest questions about the universe and ourselves. A Short History of Nearly Everything is a profoundly enlightening, surprisingly humorous, and charmingly clever adventure into the realm of human knowledge, as only Bryson can render it. His revamped Short History is a thrilling journey through time and space, and his writing will make readers both new and old see the world in a whole new way.",
    "pageCount": 562,
    "publishedDate": "2003-05-06",
    "genres": [
      "History"
    ],
    "isbn": "9780767916417",
    "dateFinished": "2024-09-02T05:00:00.000Z",
    "rating": 4,
    "format": "audiobook"
  },
  {
    "id": "1768341388328-gt0c45bd5",
    "title": "Don Quixote - Part 1",
    "author": "Miguel de Cervantes",
    "status": "finished",
    "coverUrl": "http://books.google.com/books/content?id=UaTTAwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "description": "Don Quixote (/ˌdɒn kiːˈhoʊtiː/; Spanish: [ˈdoŋ kiˈxote] ( listen)), fully titled The Ingenious Gentleman Don Quixote of La Mancha (Spanish: El ingenioso hidalgo don Quijote de la Mancha), is a Spanish novel by Miguel de Cervantes Saavedra. It follows the adventures of Alonso Quixano, an hidalgo who reads so many chivalric novels that he decides to set out to revive chivalry, under the name Don Quixote. He recruits a simple farmer, Sancho Panza, as his squire, who often employs a unique, earthly wit in dealing with Don Quixote's rhetorical orations on antiquated knighthood. Don Quixote is met by the world as it is, initiating such themes as intertextuality, realism, metatheatre, and literary representation. Published in two volumes, in 1605 and 1615, Don Quixote is considered the most influential work of literature from the Spanish Golden Age and the entire Spanish literary canon. As a founding work of modern Western literature, and one of the earliest canonical novels, it regularly appears high on lists of the greatest works of fiction ever published. It has had major influence on the literary community, as evidenced by direct references in Alexandre Dumas' The Three Musketeers (1844) and Mark Twain's Adventures of Huckleberry Finn (1884). In a 2002 list, Don Quixote was cited as the \"best literary work ever written\".",
    "pageCount": 2038,
    "publishedDate": "2014-06-17",
    "genres": [
      "Fiction"
    ],
    "isbn": "9783736819498",
    "dateFinished": "2024-05-01T05:00:00.000Z",
    "rating": 4,
    "format": "audiobook"
  },
  {
    "id": "1768341388328-qs7k3xu50",
    "title": "Neither Here Nor There",
    "author": "Bill Bryson",
    "status": "want-to-read",
    "coverUrl": "http://books.google.com/books/content?id=b5MgQddglHgC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "description": "Bryson brings his unique brand of humour to travel writing as he shoulders his backpack, keeps a tight hold on his wallet and heads for Europe. Travelling with Stephen Katz—also his wonderful sidekick in A Walk in the Woods—he wanders from Hammerfest in the far north, to Istanbul on the cusp of Asia. As he makes his way round this incredibly varied continent, he retraces his travels as a student twenty years before with caustic hilarity.",
    "pageCount": 298,
    "publishedDate": "2012-09-25",
    "genres": [
      "Travel"
    ],
    "isbn": "9780385674553",
    "dateFinished": "2024-06-12T05:00:00.000Z",
    "rating": 2,
    "format": "audiobook"
  },
  {
    "id": "1768341388328-4y5hldqc4",
    "title": "Wasp Factory",
    "author": "Iain Banks",
    "status": "finished",
    "coverUrl": "http://books.google.com/books/content?id=LC86AgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "description": "'One of the most brilliant first novels I have come across' Telegraph 'One of the top 100 novels of the century' Independent 'Brilliant...irresistible...compelling' New York Times 'Macabre, bizarre, and impossible to put down' Financial Times 'Read it if you dare' Daily Express The Wasp Factory is a bizarre, imaginative, disturbing, and darkly comic look into the mind of a child psychopath - one of the most infamous of contemporary Scottish novels. 'Two years after I killed Blyth I murdered my young brother Paul, for quite different reasons than I'd disposed of Blyth, and then a year after that I did for my young cousin Esmerelda, more or less on a whim. That's my score to date. Three. I haven't killed anybody for years, and don't intend to ever again. It was just a stage I was going through.' Enter - if you can bear it - the extraordinary private world of Frank, just sixteen, and unconventional, to say the least.",
    "pageCount": 140,
    "publishedDate": "2008-09-04",
    "genres": [
      "Fiction"
    ],
    "isbn": "9780748109951",
    "dateFinished": "2024-07-14T05:00:00.000Z",
    "rating": 3,
    "format": "audiobook"
  },
  {
    "id": "1768341388328-hs4gnxpcm",
    "title": "Vagabonding",
    "author": "Rolf Potts",
    "status": "finished",
    "coverUrl": "http://books.google.com/books/content?id=1cXYGgN_gTQC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "description": "INTERNATIONAL BESTSELLER • With a new foreword by Tim Ferriss • “Vagabonding easily remains in my top-10 list of life-changing books. Why? Because one incredible trip, especially a long-term trip, can change your life forever. And Vagabonding teaches you how to travel (and think), not just for one trip, but for the rest of your life.”—Tim Ferriss, from the foreword There’s nothing like vagabonding: taking time off from your normal life—from six weeks to four months to two years—to discover and experience the world on your own terms. In this one-of-a-kind handbook, veteran travel writer Rolf Potts explains how anyone armed with an independent spirit can achieve the dream of extended overseas travel. Now completely revised and updated, Vagabonding is an accessible and inspiring guide to • financing your travel time • determining your destination • adjusting to life on the road • working and volunteering overseas • handling travel adversity • re-assimilating back into ordinary life Updated for our ever-changing world, Vagabonding is an indispensable guide for the modern traveler.",
    "pageCount": 242,
    "publishedDate": "2002-12-24",
    "genres": [
      "Travel"
    ],
    "isbn": "9780679647423",
    "dateFinished": "2024-07-01T05:00:00.000Z",
    "rating": 3,
    "format": "book"
  },
  {
    "id": "1768341388328-34ug0auih",
    "title": "The Long Way to a Small, Angry Planet",
    "author": "Becky Chambers",
    "status": "finished",
    "coverUrl": "http://books.google.com/books/content?id=rukCrgEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
    "pageCount": 416,
    "publishedDate": "2015-08-11",
    "isbn": "1473619807",
    "dateFinished": "2024-08-06T05:00:00.000Z",
    "rating": 3,
    "format": "audiobook"
  },
  {
    "id": "1768341388328-4e78qn8h4",
    "title": "The Electric Kool-Aid Acid Test",
    "author": "Tom Wolfe",
    "status": "abandoned",
    "coverUrl": "http://books.google.com/books/content?id=gr6gkDxyxnIC&printsec=frontcover&img=1&zoom=1&source=gbs_api",
    "description": "Wolfe details his wild cross-country ride with Ken Kesey and the Merry Pranksters, offering a vivid portrayal of the hippy subculture in its own joyful, psychedelic, excessive, and terrifying colors.",
    "pageCount": 436,
    "publishedDate": "1999",
    "genres": [
      "Psychology"
    ],
    "isbn": "0553380648",
    "dateFinished": "2024-07-15T05:00:00.000Z",
    "rating": 3,
    "format": "ebook"
  },
  {
    "id": "1768341388328-ezbim83lk",
    "title": "Project Hail Mary: A Novel",
    "author": "Andy Weir",
    "status": "finished",
    "coverUrl": "http://books.google.com/books/content?id=CnSJEQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "description": "THE #1 NEW YORK TIMES BESTSELLER FROM THE AUTHOR OF THE MARTIAN • Soon to be a major motion picture starring Ryan Gosling, directed by Phil Lord and Christopher Miller, with a screenplay by Drew Goddard A lone astronaut must save the earth from disaster in this “propulsive” (Entertainment Weekly), cinematic thriller full of suspense, humor, and fascinating science. HUGO AWARD FINALIST • ONE OF THE YEAR’S BEST BOOKS: Bill Gates, GatesNotes, New York Public Library, Parade, Newsweek, Polygon, Shelf Awareness, She Reads, Kirkus Reviews, Library Journal • New York Times Readers Pick: 100 Best Books of the 21st Century “An epic story of redemption, discovery and cool speculative sci-fi.”—USA Today “If you loved The Martian, you’ll go crazy for Weir’s latest.”—The Washington Post Ryland Grace is the sole survivor on a desperate, last-chance mission—and if he fails, humanity and the earth itself will perish. Except that right now, he doesn’t know that. He can’t even remember his own name, let alone the nature of his assignment or how to complete it. All he knows is that he’s been asleep for a very, very long time. And he’s just been awakened to find himself millions of miles from home, with nothing but two corpses for company. His crewmates dead, his memories fuzzily returning, Ryland realizes that an impossible task now confronts him. Hurtling through space on this tiny ship, it’s up to him to puzzle out an impossible scientific mystery—and conquer an extinction-level threat to our species. And with the clock ticking down and the nearest human being light-years away, he’s got to do it all alone. Or does he? An irresistible interstellar adventure as only Andy Weir could deliver, Project Hail Mary is a tale of discovery, speculation, and survival to rival The Martian—while taking us to places it never dreamed of going.",
    "pageCount": 497,
    "publishedDate": "2025-12-02",
    "genres": [
      "Fiction"
    ],
    "isbn": "9798217299461",
    "dateFinished": "2024-06-03T05:00:00.000Z",
    "rating": 4,
    "format": "ebook"
  },
  {
    "id": "1768341388328-o8s2xr20s",
    "title": "A Confederacy of Dunces",
    "author": "John Kennedy Toole",
    "status": "finished",
    "coverUrl": "http://books.google.com/books/content?id=WM6OztAsYWQC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "description": "Released by Louisiana State University Press in 1980, A Confederacy of Dunces is nothing short of a publishing phenomenon. Rejected by countless publishers and submitted by the author's mother years after his suicide, the book won the 1981 Pulitzer Prize for Fiction. Today there are almost two million copies in print worldwide in eighteen languages. Now, for the first time, John Kennedy Toole's comic masterpiece is available in a large print edition. Toole's lunatic and sage novel introduces one of the most memorable characters in American literature, Ignatius Reilly, whom Walker Percy dubs \"slob extraordinaire, a mad Oliver Hardy, a fat Don Quixote, a perverse Thomas Aquinas rolled into one.\" Set in New Orleans, A Confederacy of Dunces outswifts Swift, one of whose essays gives the book its title. As its characters burst into life, they leave the region and literature forever changed by their presence -- Ignatius and his mother; Miss Trixie, the octogenarian assistant accountant at Levi Pants; inept, wan Patrolman Mancuso; Darlene, the Bourbon Street stripper with a penchant for poultry; Jones the jivecat in spaceage dark glasses. Included here is the introduction that writer and New Orleans resident Andrei Codrescu composed for the book's twentieth anniversary. Set in oversized type for ease in reading, the large print edition will gratify both first-timers seeking to discover this modern-day classic and longtime afficionados wishing to reread a favorite novel.",
    "pageCount": 636,
    "publishedDate": "2004-09-01",
    "genres": [
      "Fiction"
    ],
    "isbn": "0807130087",
    "rating": 5,
    "format": "book"
  },
  {
    "id": "1768341388328-0prp7yhod",
    "title": "Dharma Bums",
    "author": "Jack Kerouac",
    "status": "finished",
    "coverUrl": "http://books.google.com/books/content?id=-oBPEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "description": "Jack Kerouac’s classic novel about friendship, the search for meaning, and the allure of nature “In [On the Road] Kerouac’s heroes were sensation seekers; now they are seekers after truth . . . the novel often attains a beautiful dignity.”—Chicago Tribune First published in 1958, a year after On the Road put the Beat Generation on the map, The Dharma Bums stands as one of Jack Kerouac’s most powerful and influential novels. The story focuses on two ebullient young Americans—mountaineer, poet, and Zen Buddhist Japhy Ryder, and Ray Smith, a zestful, innocent writer—whose quest for Truth leads them on a heroic odyssey, from marathon parties and poetry jam sessions in San Francisco’s Bohemia to solitude and mountain climbing in the High Sierras.",
    "pageCount": 257,
    "publishedDate": "1971-05-27",
    "genres": [
      "Fiction"
    ],
    "isbn": "9780140042528",
    "dateFinished": "2024-06-12T05:00:00.000Z",
    "rating": 2,
    "format": "book"
  },
  {
    "id": "1768341388328-kgmnlh13a",
    "title": "Dante’s Inferno",
    "author": "Dante Alighieri",
    "status": "finished",
    "coverUrl": "http://books.google.com/books/content?id=B8DHyhZK8ZQC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "description": "This startling new translation of Dante's Inferno is by Ciaran Carson, one of contemporary Ireland's most dazzlingly gifted poets. Written in a vigorous and inventive contemporary idiom, while also reproducing the intricate rhyme-scheme that is so essential to the beauty and power of Dante's epic, Carson's virtuosic rendering of the Inferno is that rare thing—a translation with the heft and force of a true English poem. Like Seamus Heaney's Beowulf and Ted Hughes's Tales from Ovid, Ciaran Carson's Inferno is an extraordinary modern response to one of the great works of world literature.",
    "pageCount": 332,
    "publishedDate": "2004-10-31",
    "genres": [
      "Poetry"
    ],
    "isbn": "1590171144",
    "dateFinished": "2024-04-25T05:00:00.000Z",
    "rating": 3,
    "format": "book"
  },
  {
    "id": "1768341388328-2fspu9tjz",
    "title": "My Side of the Mountain",
    "author": "Jean Craighead George",
    "status": "finished",
    "coverUrl": "http://books.google.com/books/content?id=pczYDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "description": "A NEWBERY HONOR BOOK • OVER 4 MILLION COPIES SOLD • The defining childhood classic about a boy finding his own way in the wilderness—a nostalgic book for readers young and old who have ever wanted to run away from home. “Should appeal to all rugged individualists who dream of escape to the forest.”—The New York Times Book Review “An extraordinary book… It will be read year after year.”—The Horn Book Twelve-year-old Sam Gribley is terribly unhappy living in his family’s crowded New York City apartment. One day—armed with just a penknife, a ball of red cord, forty dollars, some flint and steel, and the clothes on his back—he decides to run away to his grandfather’s abandoned farm in the Catskill Mountains, to live in the woods all by himself. There, Sam must rely on his own ingenuity and the resources of the great outdoors to survive, as he discovers a side of himself he never knew existed. Teeming with hope, adventure, and a deep search for identity, My Side of the Mountain is a timeless classic for readers of all ages who have ever wondered what it would be like to live off the land. American Library Association Notable Book • Hans Christian Andersen Award Honor Book • Lewis Carroll Shelf Award",
    "pageCount": 194,
    "publishedDate": "2004-04-12",
    "genres": [
      "Juvenile Fiction"
    ],
    "isbn": "9780142401118",
    "dateFinished": "2024-06-05T05:00:00.000Z",
    "rating": 3,
    "format": "book"
  },
  {
    "id": "1768341388328-eomjw1m2n",
    "title": "Where the Deer and the Antelope Play",
    "author": "Nick Offerman",
    "status": "finished",
    "coverUrl": "http://books.google.com/books/content?id=1QnJEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "description": "A humorous and rousing set of literal and figurative sojourns as well as a mission statement about comprehending, protecting, and truly experiencing the outdoors, fueled by three journeys undertaken by actor, humorist, and New York Times bestselling author Nick Offerman Nick Offerman has always felt a particular affection for the Land of the Free—not just for the people and their purported ideals but to the actual land itself: the bedrock, the topsoil, and everything in between that generates the health of your local watershed. In his new book, Nick takes a humorous, inspiring, and elucidating trip to America's trails, farms, and frontier to examine the people who inhabit the land, what that has meant to them and us, and to the land itself, both historically and currently. In 2018, Wendell Berry posed a question to Nick, a query that planted the seed of this book, sending Nick on two memorable journeys with pals—a hiking trip to Glacier National Park with his friends Jeff Tweedy and George Saunders, as well as an extended visit to his friend James Rebanks, the author of The Shepherd's Life and English Pastoral. He followed that up with an excursion that could only have come about in 2020—Nick and his wife, Megan Mullally, bought an Airstream trailer to drive across (several of) the United States. These three quests inspired some “deep-ish\" thinking from Nick, about the history and philosophy of our relationship with nature in our national parks, in our farming, and in our backyards; what we mean when we talk about conservation; and the importance of outdoor recreation, all subjects very close to Nick's heart. With witty, heartwarming stories and a keen insight into the human problems we all confront, this is both a ramble through and celebration of the land we all love.",
    "pageCount": 353,
    "publishedDate": "2023-10-03",
    "genres": [
      "Humor"
    ],
    "isbn": "9781101984703",
    "dateFinished": "2024-05-16T05:00:00.000Z",
    "rating": 2,
    "format": "audiobook"
  },
  {
    "id": "1768341388329-uy45294v8",
    "title": "This is Your Mind on Plants",
    "author": "Michael Pollan",
    "status": "finished",
    "coverUrl": "http://books.google.com/books/content?id=Fxs3EAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "description": "The instant New York Times bestseller | A Washington Post Notable Book | One of NPR's Best Books of the Year “Expert storytelling . . . [Pollan] masterfully elevates a series of big questions about drugs, plants and humans that are likely to leave readers thinking in new ways.” —New York Times Book Review From #1 New York Times bestselling author Michael Pollan, a radical challenge to how we think about drugs, and an exploration into the powerful human attraction to psychoactive plants—and the equally powerful taboos. Of all the things humans rely on plants for—sustenance, beauty, medicine, fragrance, flavor, fiber—surely the most curious is our use of them to change consciousness: to stimulate or calm, fiddle with or completely alter, the qualities of our mental experience. Take coffee and tea: People around the world rely on caffeine to sharpen their minds. But we do not usually think of caffeine as a drug, or our daily use as an addiction, because it is legal and socially acceptable. So, then, what is a “drug”? And why, for example, is making tea from the leaves of a tea plant acceptable, but making tea from a seed head of an opium poppy a federal crime? In This Is Your Mind on Plants, Michael Pollan dives deep into three plant drugs—opium, caffeine, and mescaline—and throws the fundamental strangeness, and arbitrariness, of our thinking about them into sharp relief. Exploring and participating in the cultures that have grown up around these drugs while consuming (or, in the case of caffeine, trying not to consume) them, Pollan reckons with the powerful human attraction to psychoactive plants. Why do we go to such great lengths to seek these shifts in consciousness, and then why do we fence that universal desire with laws and customs and fraught feelings? In this unique blend of history, science, and memoir, as well as participatory journalism, Pollan examines and experiences these plants from several very different angles and contexts, and shines a fresh light on a subject that is all too often treated reductively—as a drug, whether licit or illicit. But that is one of the least interesting things you can say about these plants, Pollan shows, for when we take them into our bodies and let them change our minds, we are engaging with nature in one of the most profound ways we can. Based in part on an essay published almost twenty-five years ago, this groundbreaking and singular consideration of psychoactive plants, and our attraction to them through time, holds up a mirror to our fundamental human needs and aspirations, the operations of our minds, and our entanglement with the natural world.",
    "pageCount": 289,
    "publishedDate": "2021-07-06",
    "genres": [
      "Body, Mind & Spirit"
    ],
    "isbn": "9780593296905",
    "dateFinished": "2024-04-11T05:00:00.000Z",
    "rating": 3,
    "format": "audiobook"
  },
  {
    "id": "1768341388329-d8ze03fi3",
    "title": "The Gods Themselves",
    "author": "Isaac Asimov",
    "status": "abandoned",
    "coverUrl": "http://books.google.com/books/content?id=VS0vsj9e3vUC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "description": "In the twenty-second century Earth obtains limitless, free energy from a source science little understands: an exchange between Earth and a parallel universe, using a process devised by the aliens. But even free energy has a price. The transference process itself will eventually lead to the destruction of the Earth's Sun—and of Earth itself. Only a few know the terrifying truth—an outcast Earth scientist, a rebellious alien inhabitant of a dying planet, a lunar-born human intuitionist who senses the imminent annihilation of the Sun. They know the truth—but who will listen? They have foreseen the cost of abundant energy—but who will believe? These few beings, human and alien, hold the key to Earth's survival.",
    "pageCount": 305,
    "publishedDate": "1990-09-04",
    "genres": [
      "Fiction"
    ],
    "isbn": "9780553288100",
    "rating": 2,
    "format": "audiobook"
  },
  {
    "id": "1768341388329-k9vvwps7c",
    "title": "You’re Not Listening",
    "author": "Kate Murphy",
    "status": "want-to-read",
    "coverUrl": "http://books.google.com/books/content?id=7CaZDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "description": "When was the last time you listened to someone, or someone really listened to you? \"If you’re like most people, you don’t listen as often or as well as you’d like. There’s no one better qualified than a talented journalist to introduce you to the right mindset and skillset—and this book does it with science and humor.\" -Adam Grant, #1 New York Times bestselling author of Originals and Give and Take **Hand picked by Malcolm Gladwell, Adam Grant, Susan Cain, and Daniel Pink for Next Big Ideas Club** \"An essential book for our times.\" -Lori Gottlieb, New York Times bestselling author of Maybe You Should Talk to Someone At work, we’re taught to lead the conversation. On social media, we shape our personal narratives. At parties, we talk over one another. So do our politicians. We’re not listening. And no one is listening to us. Despite living in a world where technology allows constant digital communication and opportunities to connect, it seems no one is really listening or even knows how. And it’s making us lonelier, more isolated, and less tolerant than ever before. A listener by trade, New York Times contributor Kate Murphy wanted to know how we got here. In this always illuminating and often humorous deep dive, Murphy explains why we’re not listening, what it’s doing to us, and how we can reverse the trend. She makes accessible the psychology, neuroscience, and sociology of listening while also introducing us to some of the best listeners out there (including a CIA agent, focus group moderator, bartender, radio producer, and top furniture salesman). Equal parts cultural observation, scientific exploration, and rousing call to action that's full of practical advice, You're Not Listening is to listening what Susan Cain's Quiet was to introversion. It’s time to stop talking and start listening.",
    "pageCount": 165,
    "publishedDate": "2020-01-07",
    "genres": [
      "Psychology"
    ],
    "isbn": "9781250297204",
    "dateFinished": "2024-09-14T05:00:00.000Z",
    "rating": 3,
    "format": "audiobook"
  },
  {
    "id": "1768341388329-nilmkyz0c",
    "title": "Hells Angels",
    "author": "Hunter S Thompson",
    "status": "finished",
    "coverUrl": "http://books.google.com/books/content?id=jQKkz9h0YJAC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "description": "Gonzo journalist and literary roustabout Hunter S. Thompson flies with the angels—Hell’s Angels, that is—in this short work of nonfiction. “California, Labor Day weekend . . . early, with ocean fog still in the streets, outlaw motorcyclists wearing chains, shades and greasy Levis roll out from damp garages, all-night diners and cast-off one-night pads in Frisco, Hollywood, Berdoo and East Oakland, heading for the Monterey peninsula, north of Big Sur. . . The Menace is loose again.” Thus begins Hunter S. Thompson’s vivid account of his experiences with California’s most notorious motorcycle gang, the Hell’s Angels. In the mid-1960s, Thompson spent almost two years living with the controversial Angels, cycling up and down the coast, reveling in the anarchic spirit of their clan, and, as befits their name, raising hell. His book successfully captures a singular moment in American history, when the biker lifestyle was first defined, and when such countercultural movements were electrifying and horrifying America. Thompson, the creator of Gonzo journalism, writes with his usual bravado, energy, and brutal honesty, and with a nuanced and incisive eye; as The New Yorker pointed out, “For all its uninhibited and sardonic humor, Thompson’s book is a thoughtful piece of work.” As illuminating now as when originally published in 1967, Hell’s Angels is a gripping portrait, and the best account we have of the truth behind an American legend.",
    "pageCount": 290,
    "publishedDate": "1999-12-07",
    "genres": [
      "Biography & Autobiography"
    ],
    "isbn": "9780679603313",
    "dateFinished": "2024-10-06T05:00:00.000Z",
    "rating": 3,
    "format": "book"
  },
  {
    "id": "1768341388329-z4wjwosrs",
    "title": "Roughing It",
    "author": "Mark Twain",
    "status": "finished",
    "coverUrl": "http://books.google.com/books/content?id=A0NlEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "description": "Deep in the Wild West, young Mark Twain adventures through America. He's on a journey to a faraway land. With his brother by his side, Twain treks from town to town, undertaking a variety of jobs along the way. A prequel to his first novel, ‘The Innocents Abroad’, ‘Roughing It’ is a wanderlust-filled tale of personal growth and travel. Crafted with wit and humour, the memoir transports readers on a journey back to Twain’s humble beginnings as a writer. Painting a captivating picture of 19th century America, the classic is perfect for Western lovers of Denzel Washington and Chris Pratt’s ‘The Magnificent Seven’. Mark Twain, pseudonym of Samuel Langhorne Clemens (1835-1910) was an American humorist, lecturer, journalist and novelist. Celebrated today as the father of American literature, his work spans epic stories of boyhood such as ‘The Adventures of Tom Sawyer’ and ‘The Adventures of Huckleberry Finn’, as well as travel narratives, such as ‘The Innocents Abroad’, ‘Roughing It’, and ‘Life on the Mississippi’. A friend to presidents, artists and royalty, he is remembered today as a popular public figure. Continuing his influence, Twain inspires Disney attractions, singer Tom Petty’s ‘Down South’ and was portrayed by Nathan Osgood in the 2018 comedy ‘Holmes and Watson’.",
    "pageCount": 538,
    "publishedDate": "2022-04-04",
    "genres": [
      "Biography & Autobiography"
    ],
    "isbn": "9788726646108",
    "dateFinished": "2024-08-19T05:00:00.000Z",
    "rating": 2,
    "format": "audiobook"
  },
  {
    "id": "1768341388329-rm0ihzp1b",
    "title": "House of Leaves",
    "author": "Mark Z. Danielewski",
    "status": "finished",
    "coverUrl": "http://books.google.com/books/content?id=qGA_3RGqTkQC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "description": "THE MIND-BENDING CULT CLASSIC ABOUT A HOUSE THAT’S LARGER ON THE INSIDE THAN ON THE OUTSIDE • A masterpiece of horror and an astonishingly immersive, maze-like reading experience that redefines the boundaries of a novel. ''Simultaneously reads like a thriller and like a strange, dreamlike excursion into the subconscious.\" —Michiko Kakutani, The New York Times \"Thrillingly alive, sublimely creepy, distressingly scary, breathtakingly intelligent—it renders most other fiction meaningless.\" —Bret Easton Ellis, bestselling author of American Psycho “This demonically brilliant book is impossible to ignore.” —Jonathan Lethem, award-winning author of Motherless Brooklyn One of The Atlantic’s Great American Novels of the Past 100 Years Years ago, when House of Leaves was first being passed around, it was nothing more than a badly bundled heap of paper, parts of which would occasionally surface on the Internet. No one could have anticipated the small but devoted following this terrifying story would soon command. Starting with an odd assortment of marginalized youth—musicians, tattoo artists, programmers, strippers, environmentalists, and adrenaline junkies—the book eventually made its way into the hands of older generations, who not only found themselves in those strangely arranged pages but also discovered a way back into the lives of their estranged children. Now made available in book form, complete with the original colored words, vertical footnotes, and second and third appendices, the story remains unchanged. Similarly, the cultural fascination with House of Leaves remains as fervent and as imaginative as ever. The novel has gone on to inspire doctorate-level courses and masters theses, cultural phenomena like the online urban legend of “the backrooms,” and incredible works of art in entirely unrealted mediums from music to video games. Neither Pulitzer Prize-winning photojournalist Will Navidson nor his companion Karen Green was prepared to face the consequences of the impossibility of their new home, until the day their two little children wandered off and their voices eerily began to return another story—of creature darkness, of an ever-growing abyss behind a closet door, and of that unholy growl which soon enough would tear through their walls and consume all their dreams.",
    "pageCount": 738,
    "publishedDate": "2000-03-07",
    "genres": [
      "Fiction"
    ],
    "isbn": "9780375420528",
    "dateFinished": "2024-05-13T05:00:00.000Z",
    "rating": 2,
    "format": "book"
  },
  {
    "id": "1768341388329-jdemcxi1h",
    "title": "Epitaph for a Desert Anarchist",
    "author": "James Bishop",
    "status": "want-to-read",
    "coverUrl": "http://books.google.com/books/content?id=pXSC0AnpzLkC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "description": "Through Abbey's own writings and personal papers, as well as interviews with friends and acquaintances, Bishop gives us a penetrating, compelling, no-holds-barred view of tile life and accomplishments of this controversial figure.",
    "pageCount": 280,
    "publishedDate": "2010-05-11",
    "genres": [
      "Biography & Autobiography"
    ],
    "isbn": "9781439143643",
    "rating": 2,
    "format": "book"
  },
  {
    "id": "1768341388329-iome5brd3",
    "title": "Child of God",
    "author": "Cormac McCarthy",
    "status": "finished",
    "coverUrl": "http://books.google.com/books/content?id=TF9DF3K4UrYC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "description": "From the bestselling author of The Passenger and the Pulitzer Prize–winning novel The Road • In this taut, chilling story, Lester Ballard—a violent, dispossessed man falsely accused of rape—haunts the hill country of East Tennessee when he is released from jail. While telling his story, Cormac McCarthy depicts the most sordid aspects of life with dignity, humor, and characteristic lyrical brilliance. \"Like the novelists he admires-Melville, Dostoyevsky, Faulkner-Cormac McCarthy has created an imaginative oeuvre greater and deeper than any single book. Such writers wrestle with the gods themselves.\" —Washington Post",
    "pageCount": 209,
    "publishedDate": "1993-06-29",
    "genres": [
      "Fiction"
    ],
    "isbn": "9780679728740",
    "dateFinished": "2024-08-04T05:00:00.000Z",
    "rating": 3,
    "format": "book"
  },
  {
    "id": "1768341388329-wafzcx88x",
    "title": "The Trial",
    "author": "Franz Kafka",
    "status": "finished",
    "coverUrl": "http://books.google.com/books/content?id=jA_ADwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "description": "In Kafka's powerful and disturbing novel, an innocent man is arrested and repeatedly interrogated for a crime that is never ever explained. Part of the Macmillan Collector’s Library, a series of stunning, clothbound, pocket-sized classics with gold-foiled edges and ribbon markers. These beautiful books make perfect gifts or a treat for any book lover. This edition is translated from German by Douglas Scott and Chris Waller, and features an afterword by David Stuart Davies. On the morning of his thirtieth birthday, a young bank official named Joseph K is arrested although he has done nothing wrong and is never told what he’s been charged with. The Trial is the chronicle of his fight to prove his innocence, of his struggles and encounters with the invisible Law and the untouchable Court where he must make regular visits. It is an account, ultimately, of state-induced self-destruction presenting in a nightmarish scenario the persecution of the outsider and the incomprehensible machinations of the state. Using the power of simple, straightforward language Kafka draws the reader into this bleak and frightening world so that we too experience the fears, uncertainties and tragedy of Joseph K.",
    "pageCount": 236,
    "publishedDate": "2020-10-01",
    "genres": [
      "Fiction"
    ],
    "isbn": "9781529036060",
    "dateFinished": "2024-09-07T05:00:00.000Z",
    "rating": 2,
    "format": "ebook"
  },
  {
    "id": "1768341388329-nuddv2v66",
    "title": "John Muir collection",
    "author": "John Muir",
    "status": "want-to-read",
    "coverUrl": "http://books.google.com/books/content?id=tiucEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "description": "In \"The Collected Works of John Muir,\" readers are invited to delve into the profound observations and lyrical musings of one of America's foremost naturalists. This compilation encompasses Muir's essays, journals, and letters, showcasing his poetic prose that both celebrates and critiques the relationship between humanity and the natural world. Muir's vivid descriptions and philosophical reflections reveal a deep reverence for wilderness, while his advocacy for conservation highlights a critical moment in America's environmental history, particularly in the late 19th and early 20th centuries, as industrialization threatened the integrity of natural landscapes. John Muir was not just a writer but a dedicated environmentalist whose passion for nature was rooted in personal experience. Growing up in the diverse ecosystems of Scotland and later in the United States, Muir's journeys through the Sierra Nevada and other wilderness areas fueled his ecological consciousness. His role in founding the Sierra Club and efforts in establishing national parks underscored his commitment to preserving the beauty of America's landscapes, which he eloquently articulated through his writings. This anthology is highly recommended for those seeking inspiration, as it resonates with contemporary environmental challenges and fosters a deeper appreciation for nature. Muir's narratives encourage readers to reflect on their relationship with the earth, making it an essential addition for environmentalists, literature enthusiasts, and anyone yearning for a more profound connection to the natural world.",
    "pageCount": 1437,
    "publishedDate": "2022-11-13",
    "genres": [
      "Nature"
    ],
    "rating": 1,
    "format": "book"
  },
  {
    "id": "1768341388329-qe4u8cpww",
    "title": "The Wisdom of John Muir",
    "author": "Anne Rowthorn",
    "status": "want-to-read",
    "coverUrl": "http://books.google.com/books/content?id=iXJKAQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "description": "Largely using the Muir's own words, the author looks at the experiences, places and people that inspired and informed the naturalist's words and beliefs. Selected and commented on by the author of Your Daily Life Is Your Temple. Original.",
    "pageCount": 234,
    "publishedDate": "2012-03-27",
    "genres": [
      "Nature"
    ],
    "isbn": "9780899976945",
    "rating": 2,
    "format": "book"
  },
  {
    "id": "1768341388329-1gts1d8ok",
    "title": "Right Kind of Wrong (Kindle)",
    "author": "Amy Edmondson",
    "status": "want-to-read",
    "coverUrl": "http://books.google.com/books/content?id=or0JfiiVkxgC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "description": "In this diverse volume new methodologies are introduced, such as the strategic fitness process for engaging leaders in better understanding the reactions of employees to strategic change efforts (Beer); Jazz as a metaphor for organizational improvisation (Bernstein & Barrett); and new theories for understanding change processes (Gomez & Ballard).",
    "pageCount": 309,
    "publishedDate": "2011-07-07",
    "genres": [
      "Business & Economics"
    ],
    "isbn": "9781780520223",
    "format": "ebook"
  },
  {
    "id": "1768341388329-5rl5r851x",
    "title": "Empowered",
    "author": "Marty Cagan",
    "status": "want-to-read",
    "coverUrl": "http://books.google.com/books/content?id=rdsMEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "description": "What is it about the top tech product companies such as Amazon, Apple, Google, Netflix and Tesla that enables their record of consistent innovation? Most people think it’s because these companies are somehow able to find and attract a level of talent that makes this innovation possible. But the real advantage these companies have is not so much who they hire, but rather how they enable their people to work together to solve hard problems and create extraordinary products. As legendary Silicon Valley coach--and coach to the founders of several of today’s leading tech companies--Bill Campbell said, “Leadership is about recognizing that there's a greatness in everyone, and your job is to create an environment where that greatness can emerge.” The goal of EMPOWERED is to provide you, as a leader of product management, product design, or engineering, with everything you’ll need to create just such an environment. As partners at The Silicon Valley Product Group, Marty Cagan and Chris Jones have long worked to reveal the best practices of the most consistently innovative companies in the world. A natural companion to the bestseller INSPIRED, EMPOWERED tackles head-on the reason why most companies fail to truly leverage the potential of their people to innovate: product leadership. The book covers: what it means to be an empowered product team, and how this is different from the “feature teams” used by most companies to build technology products recruiting and coaching the members of product teams, first to competence, and then to reach their potential creating an inspiring product vision along with an insights-driven product strategy translating that strategy into action by empowering teams with specific objectives—problems to solve—rather than features to build redefining the relationship of the product teams to the rest of the company detailing the changes necessary to effectively and successfully transform your organization to truly empowered product teams EMPOWERED puts decades of lessons learned from the best leaders of the top technology companies in your hand as a guide. It shows you how to become the leader your team and company needs to not only survive but thrive.",
    "pageCount": 432,
    "publishedDate": "2020-12-03",
    "genres": [
      "Business & Economics"
    ],
    "isbn": "9781119691327",
    "format": "audiobook"
  },
  {
    "id": "1768341388329-8c5b5i9rs",
    "title": "Donut Economics",
    "author": "Kate Raworth",
    "status": "want-to-read",
    "coverUrl": "http://books.google.com/books/content?id=bXSrEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "description": "Economics is the mother tongue of public policy. It dominates our decision-making for the future, guides multi-billion-dollar investments, and shapes our responses to climate change, inequality, and other environmental and social challenges that define our times. Pity then, or more like disaster, that its fundamental ideas are centuries out of date yet are still taught in college courses worldwide and still used to address critical issues in government and business alike. That’s why it is time, says renegade economist Kate Raworth, to revise our economic thinking for the 21st century. In Doughnut Economics, she sets out seven key ways to fundamentally reframe our understanding of what economics is and does. Along the way, she points out how we can break our addiction to growth; redesign money, finance, and business to be in service to people; and create economies that are regenerative and distributive by design. Named after the now-iconic “doughnut” image that Raworth first drew to depict a sweet spot of human prosperity (an image that appealed to the Occupy Movement, the United Nations, eco-activists, and business leaders alike), Doughnut Economics offers a radically new compass for guiding global development, government policy, and corporate strategy, and sets new standards for what economic success looks like. Raworth handpicks the best emergent ideas—from ecological, behavioral, feminist, and institutional economics to complexity thinking and Earth-systems science—to address this question: How can we turn economies that need to grow, whether or not they make us thrive, into economies that make us thrive, whether or not they grow? Simple, playful, and eloquent, Doughnut Economics offers game-changing analysis and inspiration for a new generation of economic thinkers.",
    "pageCount": 322,
    "publishedDate": "2018-03-08",
    "genres": [
      "Business & Economics"
    ],
    "isbn": "9781603587969",
    "format": "ebook"
  },
  {
    "id": "1768341388329-fl5yywciw",
    "title": "Guns, Germs and Steel",
    "author": "Jared Diamond",
    "status": "abandoned",
    "coverUrl": "http://books.google.com/books/content?id=PWnWRFEGoeUC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "description": "\"Fascinating.... Lays a foundation for understanding human history.\"—Bill Gates In this \"artful, informative, and delightful\" (William H. McNeill, New York Review of Books) book, Jared Diamond convincingly argues that geographical and environmental factors shaped the modern world. Societies that had had a head start in food production advanced beyond the hunter-gatherer stage, and then developed religion --as well as nasty germs and potent weapons of war --and adventured on sea and land to conquer and decimate preliterate cultures. A major advance in our understanding of human societies, Guns, Germs, and Steel chronicles the way that the modern world came to be and stunningly dismantles racially based theories of human history. Winner of the Pulitzer Prize, the Phi Beta Kappa Award in Science, the Rhone-Poulenc Prize, and the Commonwealth club of California's Gold Medal.",
    "pageCount": 532,
    "publishedDate": "1999-04-17",
    "genres": [
      "Social Science"
    ],
    "isbn": "9780393069228",
    "format": "audiobook"
  },
  {
    "id": "1768341388329-kqi553aje",
    "title": "Streets of Laredo",
    "author": "Larry McMurtry",
    "status": "finished",
    "coverUrl": "http://books.google.com/books/content?id=T2cSoiQO2hoC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "description": "From the Pulitzer Prize–winning author Larry McMurtry comes the final book in the Lonesome Dove tetralogy—an exhilarating tale of legend and heroism, Streets of Laredo is classic Texas and Western literature at its finest. Captain Woodrow Call, August McCrae's old partner, is now a bounty hunter hired to track down a brutal young Mexican bandit. Riding with Call are an Eastern city slicker, a witless deputy, and one of the last members of the Hat Creek outfit, Pea Eye Parker, now married to Lorena—once Gus McCrae's sweetheart. This long chase leads them across the last wild stretches of the West into a hellhole known as Crow Town and, finally, into the vast, relentless plains of the Texas frontier.",
    "pageCount": 565,
    "publishedDate": "2010-06-01",
    "genres": [
      "Fiction"
    ],
    "isbn": "9781439126370",
    "rating": 4,
    "format": "book"
  },
  {
    "id": "1768341388329-gwies6hx7",
    "title": "Dead Man’s Walk",
    "author": "Larry McMurtry",
    "status": "finished",
    "coverUrl": "http://books.google.com/books/content?id=3tTP-4_tInwC&printsec=frontcover&img=1&zoom=1&source=gbs_api",
    "description": "In Dead Man's Walk, the prequel to the bestselling books, Lonesome Dove and Streets of Laredo, McMurtry dazzles readers once more with the early adventures of two of the most memorable heroes in contemporary fiction--Augustus McCrae and Woodrow Call. National ads/media.",
    "pageCount": 652,
    "publishedDate": "1996",
    "genres": [
      "Fiction"
    ],
    "isbn": "0783815107",
    "dateFinished": "2025-03-03T06:00:00.000Z",
    "rating": 4,
    "format": "audiobook"
  },
  {
    "id": "1768341388329-tp6owiw78",
    "title": "Comanche Moon",
    "author": "Larry McMurtry",
    "status": "finished",
    "coverUrl": "http://books.google.com/books/content?id=eN7uBwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "description": "Set against the bitter frontier strife between Texans and the Comanche, Texas Rangers Gus McCrae and Woodrow Call battle Buffalo Hump, the enigmatic war chief, and Gus' long-time nemesis, Blue Duck.",
    "pageCount": 720,
    "publishedDate": "2000-10-17",
    "genres": [
      "Fiction"
    ],
    "isbn": "9780684857558",
    "dateFinished": "2024-12-25T06:00:00.000Z",
    "rating": 4,
    "format": "audiobook"
  },
  {
    "id": "1768341388329-3u2ecqap7",
    "title": "Tomorrow Tomorrow Tomorrow",
    "author": "Gabrielle Zevin",
    "status": "want-to-read",
    "coverUrl": "http://books.google.com/books/content?id=LML4EAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "description": "NEW YORK TIMES BESTSELLER • Sam and Sadie—two college friends, often in love, but never lovers—become creative partners in a dazzling and intricately imagined world of video game design, where success brings them fame, joy, tragedy, duplicity, and, ultimately, a kind of immortality. It is a love story, but not one you have read before. \"Delightful and absorbing.\" —The New York Times • \"Utterly brilliant.\" —John Green One of the New York Times’s 100 Best Books of the 21st Century • A Kirkus Reviews Best Fiction Book of the Century • A Los Angeles Times Best Fiction Book of the Last 30 Years • One of the Best Books of the Year: The New York Times, Entertainment Weekly, TIME, GoodReads, Oprah Daily From the best-selling author of The Storied Life of A. J. Fikry: On a bitter-cold day, in the December of his junior year at Harvard, Sam Masur exits a subway car and sees, amid the hordes of people waiting on the platform, Sadie Green. He calls her name. For a moment, she pretends she hasn’t heard him, but then, she turns, and a game begins: a legendary collaboration that will launch them to stardom. These friends, intimates since childhood, borrow money, beg favors, and, before even graduating college, they have created their first blockbuster, Ichigo. Overnight, the world is theirs. Not even twenty-five years old, Sam and Sadie are brilliant, successful, and rich, but these qualities won’t protect them from their own creative ambitions or the betrayals of their hearts. Spanning thirty years, from Cambridge, Massachusetts, to Venice Beach, California, and lands in between and far beyond, Gabrielle Zevin’s Tomorrow, and Tomorrow, and Tomorrow examines the multifarious nature of identity, disability, failure, the redemptive possibilities in play, and above all, our need to connect: to be loved and to love.",
    "pageCount": 417,
    "publishedDate": "2024-06-25",
    "genres": [
      "Fiction"
    ],
    "isbn": "9780593466490",
    "rating": 2,
    "format": "ebook"
  },
  {
    "id": "1768341388329-c5xsve319",
    "title": "One hundred years of solitude",
    "author": "Gabriel García Márquez",
    "status": "finished",
    "coverUrl": "http://books.google.com/books/content?id=AfB8EAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "description": "Now a Netflix series adaptation starring Claudio Cataño, Jerónimo Barón, and Marco González One of the twentieth century’s enduring works, One Hundred Years of Solitude is a widely beloved and acclaimed novel known throughout the world and the ultimate achievement in a Nobel Prize–winning career. The novel tells the story of the rise and fall of the mythical town of Macondo through the history of the Buendía family. Rich and brilliant, it is a chronicle of life, death, and the tragicomedy of humankind. In the beautiful, ridiculous, and tawdry story of the Buendía family, one sees all of humanity, just as in the history, myths, growth, and decay of Macondo, one sees all of Latin America. Love and lust, war and revolution, riches and poverty, youth and senility, the variety of life, the endlessness of death, the search for peace and truth—these universal themes dominate the novel. Alternately reverential and comical, One Hundred Years of Solitude weaves the political, personal, and spiritual to bring a new consciousness to storytelling. Translated into dozens of languages, this stunning work is no less than an account of the history of the human race.",
    "pageCount": 342,
    "publishedDate": "2022-10-11",
    "genres": [
      "Fiction"
    ],
    "isbn": "9798200952090",
    "dateFinished": "2024-11-25T06:00:00.000Z",
    "rating": 4,
    "format": "book"
  },
  {
    "id": "1768341388329-xq1vjh8c1",
    "title": "A Brief History of Time",
    "author": "Stephen Hawking",
    "status": "finished",
    "coverUrl": "http://books.google.com/books/content?id=3UZuAAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "description": "#1 NEW YORK TIMES BESTSELLER A landmark volume in science writing by one of the great minds of our time, Stephen Hawking’s book explores such profound questions as: How did the universe begin—and what made its start possible? Does time always flow forward? Is the universe unending—or are there boundaries? Are there other dimensions in space? What will happen when it all ends? Told in language we all can understand, A Brief History of Time plunges into the exotic realms of black holes and quarks, of antimatter and “arrows of time,” of the big bang and a bigger God—where the possibilities are wondrous and unexpected. With exciting images and profound imagination, Stephen Hawking brings us closer to the ultimate secrets at the very heart of creation.",
    "pageCount": 226,
    "publishedDate": "1998-09-01",
    "genres": [
      "Science"
    ],
    "isbn": "9780553380163",
    "dateFinished": "2024-10-05T05:00:00.000Z",
    "rating": 2,
    "format": "audiobook"
  },
  {
    "id": "1768341388329-hzl1jq570",
    "title": "Hondo",
    "author": "Louis L'Amour",
    "status": "finished",
    "coverUrl": "http://books.google.com/books/content?id=yxidDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "description": "As part of the Louis L’Amour’s Lost Treasures series, this edition contains exclusive bonus materials! He was etched by the desert’s howling winds, a big, broad-shouldered man who knew the ways of the Apache and the ways of staying alive. She was a woman alone raising a young son on a remote Arizona ranch. And between Hondo Lane and Angie Lowe was the warrior Vittoro, whose people were preparing to rise against the white men. Now the pioneer woman, the gunman, and the Apache warrior are caught in a drama of love, war, and honor. Louis L’Amour’s Lost Treasures is a project created to release some of the author’s more unconventional manuscripts from the family archives. In Louis L’Amour’s Lost Treasures: Volumes 1, Beau L’Amour takes the reader on a guided tour through many of the finished and unfinished short stories, novels, and treatments that his father was never able to publish during his lifetime. L’Amour’s never-before-seen first novel, No Traveller Returns, faithfully completed for this program, is a voyage into danger and violence on the high seas. These exciting publications will be followed by Louis L’Amour’s Lost Treasures: Volume 2. Additionally, many beloved classics will be rereleased with an exclusive Lost Treasures postscript featuring previously unpublished material, including outlines, plot notes, and alternate drafts. These postscripts tell the story behind the stories that millions of readers have come to know and cherish.",
    "pageCount": 274,
    "publishedDate": "2019-06-25",
    "genres": [
      "Fiction"
    ],
    "isbn": "9780593129937",
    "dateFinished": "2024-11-27T06:00:00.000Z",
    "rating": 4,
    "format": "audiobook"
  },
  {
    "id": "1768341388329-3aejs3gu0",
    "title": "Transformed",
    "author": "Marty Cagan",
    "status": "want-to-read",
    "coverUrl": "http://books.google.com/books/content?id=RLruEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "description": "Help transform your business and innovate like the world's top tech companies! In INSPIRED, product thought leader Marty Cagan revealed the best practices and techniques used by the top product teams operating in the product model. Next, EMPOWERED shared the best practices and techniques used by the top product leaders to provide their teams with the kind of environment they need to thrive in the product model. Yet, the most common question after reading INSPIRED and EMPOWERED has been: \"Yes, we want to work this way, but the way we work today is so different, and so deeply ingrained, is it even possible for a company like ours to transform to the product model?\" TRANSFORMED was written to bridge the gap between where most companies are right now and where they need to be. The leaders of these companies know they must transform to compete in an era of rapidly changing enabling technology, but most of them have never operated this way before. TRANSFORMED has three big goals: First, the book will educate you with a deep understanding of the product operating model, and what it means to work that way. Second, the book will convince you with detailed case studies of successful transformations, that while difficult, it is absolutely possible for you to transform your company to the product operating model. Third, the book will inspire you with truly impressive case studies of product innovation, showing what you too will be capable of doing once you successfully transform. TRANSFORMED is written for those driving change, including the senior company leaders—starting with the CEO—as well as the senior executives and stakeholders who need to collaborate with the product teams, the product leaders, the members of the product teams, and all those who either support or depend on these product teams. Written by best-selling author Marty Cagan and his partners at the Silicon Valley Product Group, TRANSFORMED is filled with real-world examples and proven, practical advice from their decades of experience helping companies move to the product operating model.",
    "pageCount": 375,
    "publishedDate": "2024-03-12",
    "genres": [
      "Business & Economics"
    ],
    "isbn": "9781119697336",
    "rating": 2,
    "format": "ebook"
  },
  {
    "id": "1768341388329-6thswyx9s",
    "title": "American Gods",
    "author": "Neil Gamen",
    "status": "finished",
    "coverUrl": "http://books.google.com/books/content?id=cLhVjQGs83QC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "description": "Shadow is a man with a past. But now he wants nothing more than to live a quiet life with his wife and stay out of trouble. Until he learns that she's been killed in a terrible accident. Flying home for the funeral, as a violent storm rocks the plane, a strange man in the seat next to him introduces himself. The man calls himself Mr. Wednesday, and he knows more about Shadow than is possible. He warns Shadow that a far bigger storm is coming. And from that moment on, nothing will ever he the same...",
    "pageCount": 628,
    "publishedDate": "2002-04-30",
    "genres": [
      "Fiction"
    ],
    "isbn": "9780380789030",
    "dateFinished": "2025-03-02T06:00:00.000Z",
    "rating": 3,
    "format": "book"
  },
  {
    "id": "1768341388329-32vd3q2a0",
    "title": "Never Search Alone",
    "author": "Phyl Terry",
    "status": "finished",
    "coverUrl": "http://books.google.com/books/content?id=Ls5UzwEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
    "description": "Why do People So Often Fail to Build Careers They Really Love? Based on 25 years of experience working with thousands of leaders - from early-career product managers to CEOs - Never Search Alone gives readers a time-tested, multi-step process (with exercises, tools, and templates) to find the right job now. Three breakthrough ideas animate Never Search Alone: 1. Job Search Council - Because your emotional balance is the most important thing you need to manage in the job search, you need a support group of fellow job seekers that will help turn your insecurity and anxiety into hope, motivation, and accountability. 2. Candidate-Market Fit - You are the 'product' in a job search. Thus, before you begin networking and interviewing, you need to identify precisely what you want and what the market wants. This key step will help you figure out the intersection of your hopes, dreams, and market realities. 3. Four Legs to the Negotiations Stool - Never Search Alone shows you how to interview and then negotiate for the four key things that will set you up to succeed in your new job: salary, budget, resources, and support. To accelerate your career and make your dreams more achievable, Never Search Alone.",
    "pageCount": 0,
    "publishedDate": "2022-09-13",
    "isbn": "9798985409017",
    "dateFinished": "2024-11-08T06:00:00.000Z",
    "rating": 3,
    "format": "ebook"
  },
  {
    "id": "1768341388329-zzh4eju63",
    "title": "All The Pretty Horses",
    "author": "Cormac McCarthy",
    "status": "finished",
    "coverUrl": "http://books.google.com/books/content?id=BN2JDQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "description": "NATIONAL BOOK AWARD WINNER • NATIONAL BESTSELLER • The first volume in the Border Trilogy, from the bestselling author of The Passenger and the Pulitzer Prize–winning novel The Road All the Pretty Horses is the tale of John Grady Cole, who at sixteen finds himself at the end of a long line of Texas ranchers, cut off from the only life he has ever imagined for himself. With two companions, he sets off for Mexico on a sometimes idyllic, sometimes comic journey to a place where dreams are paid for in blood.",
    "pageCount": 322,
    "publishedDate": "1993-06-29",
    "genres": [
      "Fiction"
    ],
    "isbn": "9780679744399",
    "rating": 4,
    "format": "book"
  },
  {
    "id": "1768341388329-7w0e3zr79",
    "title": "The Crossing",
    "author": "Cormac McCarthy",
    "status": "finished",
    "coverUrl": "http://books.google.com/books/content?id=PziJ40EAlVkC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "description": "NATIONAL BESTSELLER • The second volume of the award-winning Border Trilogy—From the bestselling author of The Passenger and the Pulitzer Prize–winning novel The Road—fulfills the promise of All the Pretty Horses and at the same time give us a work that is darker and more visionary, a novel with the unstoppable momentum of a classic western and the elegaic power of a lost American myth. In the late 1930s, sixteen-year-old Billy Parham captures a she-wolf that has been marauding his family's ranch. But instead of killing it, he decides to take it back to the mountains of Mexico. With that crossing, he begins an arduous and often dreamlike journey into a country where men meet ghosts and violence strikes as suddenly as heat-lightning—a world where there is no order \"save that which death has put there.\" An essential novel by any measure, The Crossing is luminous and appalling, a book that touches, stops, and starts the heart and mind at once.",
    "pageCount": 434,
    "publishedDate": "2010-08-11",
    "genres": [
      "Fiction"
    ],
    "isbn": "9780307762467",
    "rating": 4,
    "format": "book"
  },
  {
    "id": "1768341388329-1c2k10eqs",
    "title": "Pinball: A Graphic History of the Silver Ball",
    "author": "Jon Chad",
    "status": "finished",
    "coverUrl": "http://books.google.com/books/content?id=3woGEQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "description": "in this dynamic, nonfiction graphic novel, Jon Chad illustrates the little-known story of pinball—how it works and why it all matters in an age of special effects and on-screen gaming. In 1976, champion player Roger Sharpe stepped up to a pinball machine in a Manhattan courtroom. The New York City Council had convened to consider lifting the city’s ban on pinball—a game that had been outlawed since 1942 for its supposed connections to gambling and organized crime. Sharpe was there to prove that, unlike a slot machine, pinball wasn’t a game of chance designed to fleece its players—it was a game of skill that required a measure of patience, coordination, and control. To prove his point, he proclaimed that he would launch his ball into the center lane at the far end of the playfield—much like Babe Ruth famously pointing to the fences. Sharpe pulled back the plunger and released, and the fate of this industry and art form hung in the balance. Thus opens Jon Chad’s comprehensive graphic novel to the history of the captivating, capricious—and at times infuriating!—game of pinball. Tracing pinball’s roots back to the Court of King Louis XIV, through the immigrant experience of early 20th century America, the post-War boom and bust, right up to the present day, Chad charmingly ushers readers through the myriad facets of this most American of pursuits—capturing not just the history but also the artistry, cultural significance, and even the physics of the game.",
    "pageCount": 210,
    "publishedDate": "2024-07-09",
    "genres": [
      "Comics & Graphic Novels"
    ],
    "isbn": "9781250386649",
    "dateFinished": "2024-12-09T06:00:00.000Z",
    "rating": 5,
    "format": "book"
  },
  {
    "id": "1768341388329-f2xivzmgr",
    "title": "Slaughter-House Five",
    "author": "Kurt Vonnegut",
    "status": "finished",
    "coverUrl": "http://books.google.com/books/content?id=pWyLDQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "description": "Kurt Vonnegut’s masterpiece, Slaughterhouse-Five is “a desperate, painfully honest attempt to confront the monstrous crimes of the twentieth century” (Time). Selected by the Modern Library as one of the 100 best novels of all time • One of The Atlantic’s Great American Novels of the Past 100 Years Slaughterhouse-Five, an American classic, is one of the world’s great antiwar books. Centering on the infamous World War II firebombing of Dresden, the novel is the result of what Kurt Vonnegut described as a twenty-three-year struggle to write a book about what he had witnessed as an American prisoner of war. It combines historical fiction, science fiction, autobiography, and satire in an account of the life of Billy Pilgrim, a barber’s son turned draftee turned optometrist turned alien abductee. As Vonnegut had, Billy experiences the destruction of Dresden as a POW. Unlike Vonnegut, he experiences time travel, or coming “unstuck in time.” An instant bestseller, Slaughterhouse-Five made Kurt Vonnegut a cult hero in American literature, a reputation that only strengthened over time, despite his being banned and censored by some libraries and schools for content and language. But it was precisely those elements of Vonnegut’s writing—the political edginess, the genre-bending inventiveness, the frank violence, the transgressive wit—that have inspired generations of readers not just to look differently at the world around them but to find the confidence to say something about it. Authors as wide-ranging as Norman Mailer, John Irving, Michael Crichton, Tim O’Brien, Margaret Atwood, Elizabeth Strout, David Sedaris, Jennifer Egan, and J. K. Rowling have all found inspiration in Vonnegut’s words. Jonathan Safran Foer has described Vonnegut as “the kind of writer who made people—young people especially—want to write.” George Saunders has declared Vonnegut to be “the great, urgent, passionate American writer of our century, who offers us . . . a model of the kind of compassionate thinking that might yet save us from ourselves.” More than fifty years after its initial publication at the height of the Vietnam War, Vonnegut’s portrayal of political disillusionment, PTSD, and postwar anxiety feels as relevant, darkly humorous, and profoundly affecting as ever, an enduring beacon through our own era’s uncertainties.",
    "pageCount": 289,
    "publishedDate": "1999-01-12",
    "genres": [
      "Fiction"
    ],
    "isbn": "9780385333849",
    "rating": 3,
    "format": "book"
  },
  {
    "id": "1768341388329-fokx9wmm8",
    "title": "The Last Picture Show",
    "author": "Larry McMurtry",
    "status": "abandoned",
    "coverUrl": "http://books.google.com/books/content?id=8Qg_DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "description": "“McMurtry is an alchemist who converts the basest materials to gold.” — New York Times Book Review The Last Picture Show (1966) is both a rambunctious coming-of-age story and an elegy to a forlorn Texas town trying to keep its one movie house alive. Adapted into the Oscar-winning film, this masterpiece immortalizes the lives of the hardscrabble residents who are threatened by the inexorable forces of the modern world.",
    "pageCount": 199,
    "publishedDate": "2018-03-20",
    "genres": [
      "Fiction"
    ],
    "isbn": "9781631493607",
    "format": "audiobook"
  },
  {
    "id": "1768341388329-9t0m9krc5",
    "title": "Apache Brave",
    "author": "Edgar Rice Bouroughs",
    "status": "want-to-read",
    "coverUrl": "http://books.google.com/books/content?id=53AdAwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "description": "Collectors Edition! Highly Recommended! Rare Burroughs Western adventure! Enjoy!",
    "pageCount": 965,
    "publishedDate": "2011-11-15",
    "genres": [
      "Foreign Language Study"
    ],
    "format": "book"
  },
  {
    "id": "1768341388329-amuhal723",
    "title": "Because Internet",
    "author": "Gretchen McCulloch",
    "status": "abandoned",
    "coverUrl": "http://books.google.com/books/content?id=a1X4DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "description": "AN INSTANT NEW YORK TIMES BESTSELLER!! Named a Best Book of 2019 by TIME, Amazon, and The Washington Post A Wired Must-Read Book of Summer “Gretchen McCulloch is the internet’s favorite linguist, and this book is essential reading. Reading her work is like suddenly being able to see the matrix.” —Jonny Sun, author of everyone's a aliebn when ur a aliebn too Because Internet is for anyone who's ever puzzled over how to punctuate a text message or wondered where memes come from. It's the perfect book for understanding how the internet is changing the English language, why that's a good thing, and what our online interactions reveal about who we are. Language is humanity's most spectacular open-source project, and the internet is making our language change faster and in more interesting ways than ever before. Internet conversations are structured by the shape of our apps and platforms, from the grammar of status updates to the protocols of comments and @replies. Linguistically inventive online communities spread new slang and jargon with dizzying speed. What's more, social media is a vast laboratory of unedited, unfiltered words where we can watch language evolve in real time. Even the most absurd-looking slang has genuine patterns behind it. Internet linguist Gretchen McCulloch explores the deep forces that shape human language and influence the way we communicate with one another. She explains how your first social internet experience influences whether you prefer \"LOL\" or \"lol,\" why ~sparkly tildes~ succeeded where centuries of proposals for irony punctuation had failed, what emoji have in common with physical gestures, and how the artfully disarrayed language of animal memes like lolcats and doggo made them more likely to spread.",
    "pageCount": 337,
    "publishedDate": "2020-07-21",
    "genres": [
      "Social Science"
    ],
    "isbn": "9780735210943",
    "rating": 2,
    "format": "book"
  },
  {
    "id": "1768341388329-02z65v9kj",
    "title": "Radical Candor",
    "author": "Kim Scott",
    "status": "want-to-read",
    "coverUrl": "http://books.google.com/books/content?id=cCqLDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "description": "* New York Times and Wall Street Journal bestseller multiple years running * Translated into 20 languages, with more than half a million copies sold worldwide * A Hudson and Indigo Best Book of the Year * Recommended by Shona Brown, Rachel Hollis, Jeff Kinney, Daniel Pink, Sheryl Sandberg, and Gretchen Rubin Radical Candor has been embraced around the world by leaders of every stripe at companies of all sizes. Now a cultural touchstone, the concept has come to be applied to a wide range of human relationships. The idea is simple: You don't have to choose between being a pushover and a jerk. Using Radical Candor—avoiding the perils of Obnoxious Aggression, Manipulative Insincerity, and Ruinous Empathy—you can be kind and clear at the same time. Kim Scott was a highly successful leader at Google before decamping to Apple, where she developed and taught a management class. Since the original publication of Radical Candor in 2017, Scott has earned international fame with her vital approach to effective leadership and co-founded the Radical Candor executive education company, which helps companies put the book's philosophy into practice. Radical Candor is about caring personally and challenging directly, about soliciting criticism to improve your leadership and also providing guidance that helps others grow. It focuses on praise but doesn't shy away from criticism—to help you love your work and the people you work with. Radically Candid relationships with team members enable bosses to fulfill their three core responsibilities: 1. Create a culture of Compassionate Candor 2. Build a cohesive team 3. Achieve results collaboratively Required reading for the most successful organizations, Radical Candor has raised the bar for management practices worldwide.",
    "pageCount": 269,
    "publishedDate": "2019-10-01",
    "genres": [
      "Business & Economics"
    ],
    "isbn": "9781250235381",
    "format": "ebook"
  },
  {
    "id": "1768341388329-2z1rr0ja2",
    "title": "Anything for Billy",
    "author": "Larry McMurtry",
    "status": "finished",
    "coverUrl": "http://books.google.com/books/content?id=RF_6bIvhDZkC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "description": "From the bestselling, Pulitzer Prize–winning “absolute master of ‘Western’ prose,” comes McMurtry’s electrifying take on the classic tale of Billy the Kid, the teenage outlaw of the American Old West. The first time I saw Billy, he came walking out of a cloud... Welcome to the wild, hot-blooded adventures of Billy the Kid, the American West’s most legendary outlaw. Larry McMurtry takes us on a hell-for-leather journey with Billy and his friends as they ride, drink, love, fight, shoot, and escape their way into the shining memories of Western myth. Surrounded by a splendid cast of characters that only Larry McMurtry could create, Billy charges headlong toward his fate, to become in death the unforgettable desperado he aspires to be in life. Not since Lonesome Dove has there been such a rich, exciting novel about the cowboys, Indians, and gunmen who live at the blazing heart of the American dream.",
    "pageCount": 420,
    "publishedDate": "2010-06-01",
    "genres": [
      "Fiction"
    ],
    "isbn": "9781451607741",
    "dateFinished": "2025-03-30T05:00:00.000Z",
    "rating": 3,
    "format": "book"
  },
  {
    "id": "1768341388329-t4uv45hum",
    "title": "Dances With Wolves",
    "author": "Michael Blake",
    "status": "finished",
    "coverUrl": "http://books.google.com/books/content?id=1Yg-DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "description": "Ordered to hold an abandoned army post, John Dunbar found himself alone, beyond the edge of civilization. Thievery and survival soon forced him into the Indian camp, where he began a dangerous adventure that changed his life forever. Relive the adventure and beauty of the incredible movie, DANCES WITH WOLVES.",
    "pageCount": 322,
    "publishedDate": "1988-08-12",
    "genres": [
      "Fiction"
    ],
    "isbn": "9780449134481",
    "rating": 4,
    "format": "audiobook"
  },
  {
    "id": "1768341388329-0ukp9ij3t",
    "title": "The Alchemist",
    "author": "Paulo Coelho",
    "status": "finished",
    "coverUrl": "http://books.google.com/books/content?id=FEL8DlqjYEkC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "description": "“To realize one’s destiny is a person’s only obligation.”—from The Alchemist The Alchemist tells the story of Santiago, the young Andalusian shepherd who dreams of buried treasure in Egypt and embarks upon a challenging journey to find it. With all the simplicity and symbolic richness of a fable, Coelho’s novel is both a hunt for buried treasure and a spiritual quest, with a hero who overcomes trials along the way with the help of teachers who guide him. Paulo Coelho’s books have difficult—and valuable—lessons to impart, but much of their appeal comes from the way Coelho dramatizes these lessons. With exquisite simplicity, the author brings to these stories his own experience of confronting life’s most profound challenges, his broad knowledge of philosophy, psychology, and literature, and a deeply-felt humanity. Freshman Common Read: Erskine College, Montana State University at Bozeman, Immaculata University, Queensborough Community College",
    "pageCount": 196,
    "publishedDate": "2009-10-13",
    "genres": [
      "Business & Economics"
    ],
    "isbn": "9780061741241",
    "dateFinished": "2025-04-12T05:00:00.000Z",
    "rating": 2,
    "format": "audiobook"
  },
  {
    "id": "1768341388329-x915fjsxo",
    "title": "Buffalo Girls",
    "author": "Larry McMurtry",
    "status": "finished",
    "coverUrl": "http://books.google.com/books/content?id=otFPvwLG524C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "description": "A strange old woman caked in Montana mud pens a letter to her darling daughter back East—the writer's name is Martha Jane, but her friends call her Calamity... I am the Wild West, no show about it. I was one of the people who kept it wild. Larry McMurtry returns to the territory of his Pulitzer Prize–winning masterwork, Lonesome Dove, to sing the song of Calamity Jane's last ride. In a letter to her daughter back East, Martha Jane is not shy about her own importance. Martha Jane—better known as Calamity—is just one of the handful of aging legends who travel to London as part of Buffalo Bill Cody's Wild West Show in Buffalo Girls. As he describes the insatiable curiosity of Calamity's Indian friend No Ears, Annie Oakley's shooting match with Lord Windhouveren, and other highlights of the tour, McMurtry turns the story of a band of hardy, irrepressible survivors into an unforgettable portrait of love, fellowship, dreams, and heartbreak.",
    "pageCount": 354,
    "publishedDate": "2010-06-01",
    "genres": [
      "Fiction"
    ],
    "isbn": "9781439128145",
    "dateFinished": "2025-03-21T05:00:00.000Z",
    "rating": 4,
    "format": "audiobook"
  },
  {
    "id": "1768341388329-ee5h9mz42",
    "title": "The Son",
    "author": "Philipp Meyer",
    "status": "finished",
    "coverUrl": "http://books.google.com/books/content?id=vZ9hpRvIQRsC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "description": "THE NEW YORK TIMES BESTSELLER NOW A MAJOR TV SERIES starring Pierce Brosnan and co-written by Philipp Meyer The critically acclaimed, New York Times-bestselling epic, a saga of land, blood and power, follows the rise of one unforgettable Texas family from the Comanche raids of the 1800s to the oil booms of the 20th century. Eli McCullough is just twelve years old when a marauding band of Comanche storm his Texas homestead, brutally murder his mother and sister and take him captive. Despite their torture and cruelty, Eli - against all odds - adapts to life with the Comanche, learning their ways and language, taking on a new name, finding a place as the adopted son of the band's chief and fighting their wars against not only other Indians but white men too, which complicates his sense of loyalty, his promised vengeance and his very understanding of self. But when disease, starvation and westward expansion finally decimate the Comanche, Eli is left alone in a world in which he belongs nowhere, neither white nor Indian, civilized nor fully wild. Deftly interweaving Eli’s story with those of his son Peter and his great-granddaughter JA, The Son maps the legacy of Eli’s ruthlessness, his drive to power and his lifelong status as an outsider, even as the McCullough family rises to become one of the richest in Texas, a ranching and oil dynasty that is as resilient and dangerous as the land they claim. Yet, like all empires, the McCulloughs must eventually face the consequences of their choices. Panoramic, deeply evocative and utterly transporting, The Son is a masterpiece American novel - part epic of Texas, part classic coming-of-age story - that combines the narrative prowess of Larry McMurtry with the knife-edge sharpness of Cormac McCarthy. 'Stunning ... a book that for once really does deserve to be called a masterpiece' Kate Atkinson 'Magnificent ... McCarthy's Border Trilogy is a point of reference, as is There Will Be Blood, but it is not fanciful to be reminded of certain passages from Moby-Dick - it's that good'The Times 'Brilliant ... a wonderful novel' Lionel Shriver",
    "pageCount": 675,
    "publishedDate": "2013-07-18",
    "genres": [
      "Fiction"
    ],
    "isbn": "9780857209450",
    "dateFinished": "2025-05-11T05:00:00.000Z",
    "rating": 3,
    "format": "audiobook"
  },
  {
    "id": "1768341388329-ghnnrjnh5",
    "title": "Leaving Cheyenne",
    "author": "Larry McMurtry",
    "status": "finished",
    "coverUrl": "http://books.google.com/books/content?id=zAg_DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "description": "“If Chaucer were a Texan writing today . . . this is how he would have written and this is how he would have felt.”— New York Times In Leaving Cheyenne (1963), which anticipates Lonesome Dove more than any other early novel, the stark realities of the American West play out in a mesmerizing love triangle. Stubborn rancher Gideon Fry, resilient Molly Taylor, and awkward ranch hand Johnny McCloud struggle with love and jealousy as the years pass.",
    "pageCount": 235,
    "publishedDate": "2018-03-20",
    "genres": [
      "Fiction"
    ],
    "isbn": "9781631493522",
    "rating": 3,
    "format": "audiobook"
  },
  {
    "id": "1768341388329-aa0ojcn7c",
    "title": "Dignity",
    "author": "Ken Layne",
    "status": "finished",
    "coverUrl": "http://books.google.com/books/content?id=Ni-MZwEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
    "description": "Composed as a collection of letters from a character called \"N,\" Dignity is set in the ruined housing tracts and bountiful desert of the American Southwest. The housing crisis has emptied the subdivisions, and the economic collapse has filled the cities with chaos and despair. In the midst of this apocalypse, a few resourceful people form self-reliant desert communities in their region's foreclosed houses and abandoned strip malls. From the shells of this collapsing civilization comes a new way of life: The citizens of these new communities grow their food, school their children, create art, take long walks through their gardens and the surrounding wilderness, and enjoy a sane and balanced relationship with their natural surroundings, themselves and each other.",
    "pageCount": 159,
    "publishedDate": "2011-05",
    "genres": [
      "Fiction"
    ],
    "isbn": "0983559821",
    "dateFinished": "2025-11-23T06:00:00.000Z",
    "rating": 2,
    "format": "book"
  },
  {
    "id": "1768341388329-zxyts5c8i",
    "title": "High Lonesome",
    "author": "Louis L'Amour",
    "status": "finished",
    "coverUrl": "http://books.google.com/books/content?id=QfyNEAAAQBAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
    "description": "Considine and Pete Runyon had once been friends, back in the days when both were cowhands. But when Runyon married the woman Considine loved, the two parted ways. Runyon settled down and became a sheriff. Considine took up robbing banks. Now Considine is planning a raid on the bank at Obaro, a plan that will pit him against Runyon . . . and lead to riches or suicide. The one thing he never counted on was meeting a strong, beautiful woman and her stubborn father, hell-bent on traveling alone through Apache territory to a new life. Suddenly Considine must choose between revenge and redemption—and either choice could be the last one he makes.",
    "publishedDate": "1962-09-01",
    "genres": [
      "Fiction"
    ],
    "isbn": "9780553259728",
    "dateFinished": "2025-11-04T06:00:00.000Z",
    "rating": 3,
    "format": "audiobook"
  },
  {
    "id": "1768341388329-t0ncvxwhc",
    "title": "Lone Woman",
    "author": "Victor Lavalle",
    "status": "finished",
    "coverUrl": "http://books.google.com/books/content?id=1it-EAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "description": "NATIONAL BESTSELLER • Blue skies, empty land—and enough wide-open space to hide a horrifying secret. A woman with a past, a mysterious trunk, a town on the edge of nowhere, and an “absorbing, powerful” (BuzzFeed) new vision of the American West, from the award-winning author of The Changeling. “Propulsive . . . LaValle combines chills with deep insights into our country’s divides.”—Los Angeles Times ONE OF BOOKPAGE'S TEN BEST BOOKS OF THE YEAR • FINALIST FOR THE LOS ANGELES TIMES BOOK PRIZE AND LOCUS AWARD • LONGLISTED FOR THE MARK TWAIN AMERICAN VOICE IN LITERATURE AWARD A BEST BOOK OF THE YEAR: The New York Times Book Review, Time, NPR, Chicago Tribune, Los Angeles Times, The Washington Post, Esquire, Vulture, Paste, Tordotcom, Book Riot, Polygon, Chicago Public Library, Kirkus Reviews, Library Journal Adelaide Henry carries an enormous steamer trunk with her wherever she goes. It’s locked at all times. Because when the trunk opens, people around Adelaide start to disappear. The year is 1915, and Adelaide is in trouble. Her secret sin killed her parents, forcing her to flee California in a hellfire rush and make her way to Montana as a homesteader. Dragging the trunk with her at every stop, she will become one of the “lone women” taking advantage of the government’s offer of free land for those who can tame it—except that Adelaide isn’t alone. And the secret she’s tried so desperately to lock away might be the only thing that will help her survive the harsh territory. Crafted by a modern master of magical suspense, Lone Women blends shimmering prose, an unforgettable cast of adventurers who find horror and sisterhood in a brutal landscape, and a portrait of early-twentieth-century America like you’ve never seen. And at its heart is the gripping story of a woman desperate to bury her past—or redeem it.",
    "pageCount": 305,
    "publishedDate": "2023-03-28",
    "genres": [
      "Fiction"
    ],
    "isbn": "9780525512080",
    "dateFinished": "2025-12-30T06:00:00.000Z",
    "rating": 4,
    "format": "audiobook"
  },
  {
    "id": "1768341388329-c5p6h8fgj",
    "title": "American Muse: Starlite Pulp Novellas, Vol 1",
    "author": "Brian Townsley",
    "status": "finished",
    "coverUrl": "http://books.google.com/books/content?id=2QDx0AEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
    "description": "This collection includes two dark westerns by Brian Townsley and Jean-Paul L. Granier, and two gritty crime yarns by Manny Torres and Alex Slusar, all thematically linked by the search for the American Dream, regardless of consequence.",
    "pageCount": 0,
    "publishedDate": "2024-08-28",
    "genres": [
      "Fiction"
    ],
    "isbn": "9798218503130",
    "dateFinished": "2025-11-11T06:00:00.000Z",
    "rating": 4,
    "format": "book"
  },
  {
    "id": "1768341388329-fh2oomjw9",
    "title": "Desert Oracle",
    "author": "Ken Layne",
    "status": "finished",
    "coverUrl": "http://books.google.com/books/content?id=dCXQDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "description": "The cult-y pocket-size field guide to the strange and intriguing secrets of the Mojave—its myths and legends, outcasts and oddballs, flora, fauna, and UFOs—becomes the definitive, oracular book of the desert For the past five years, Desert Oracle has existed as a quasi-mythical, quarterly periodical available to the very determined only by subscription or at the odd desert-town gas station or the occasional hipster boutique, its canary-yellow-covered, forty-four-page issues handed from one curious desert zealot to the next, word spreading faster than the printers could keep up with. It became a radio show, a podcast, a live performance. Now, for the first time—and including both classic and new, never-before-seen revelations—Desert Oracle has been bound between two hard covers and is available to you. Straight out of Joshua Tree, California, Desert Oracle is “The Voice of the Desert”: a field guide to the strange tales, singing sand dunes, sagebrush trails, artists and aliens, authors and oddballs, ghost towns and modern legends, musicians and mystics, scorpions and saguaros, out there in the sand. Desert Oracle is your companion at a roadside diner, around a campfire, in your tent or cabin (or high-rise apartment or suburban living room) as the wind and the coyotes howl outside at night. From journal entries of long-deceased adventurers to stray railroad ad copy, and musings on everything from desert flora, rumored cryptid sightings, and other paranormal phenomena, Ken Layne's Desert Oracle collects the weird and the wonderful of the American Southwest into a single, essential volume.",
    "pageCount": 193,
    "publishedDate": "2020-12-08",
    "genres": [
      "Nature"
    ],
    "isbn": "9780374722388",
    "dateFinished": "2025-12-07T06:00:00.000Z",
    "rating": 4,
    "format": "book"
  },
  {
    "id": "1768341388329-gcj2j34cf",
    "title": "Train Dreams",
    "author": "Denis Johnson",
    "status": "finished",
    "coverUrl": "http://books.google.com/books/content?id=AqDN6RUE6ygC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "description": "A New York Times Notable Book for 2011 One of The Economist's 2011 Books of the Year One of NPR's 10 Best Novels of 2011 From the National Book Award-winning author Denis Johnson (Tree of Smoke) comes Train Dreams, an epic in miniature, and one of Johnson's most evocative works of fiction. Suffused with the history and landscapes of the American West—its otherworldly flora and fauna, its rugged loggers and bridge builders—this extraordinary novella poignantly captures the disappearance of a distinctly American way of life. It tells the story of Robert Grainer, a day laborer in the American West at the start of the twentieth century—an ordinary man in extraordinary times. Buffeted by the loss of his family, Grainer struggles to make sense of this strange new world. As his story unfolds, we witness both his shocking personal defeats and the radical changes that transform America in his lifetime.",
    "pageCount": 126,
    "publishedDate": "2011-08-30",
    "genres": [
      "Fiction"
    ],
    "isbn": "9781429995207",
    "dateFinished": "2026-01-02T06:00:00.000Z",
    "format": "book"
  },
  {
    "id": "1768341388329-zi5ba8onn",
    "title": "The Buffalo Hunter Hunter",
    "author": "Stephen Graham Jones",
    "status": "currently-reading",
    "coverUrl": "http://books.google.com/books/content?id=Mx4OEQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "description": "An instant New York Times bestseller, a chilling historical horror novel tracing the life of a vampire who haunts the fields of the Blackfeet reservation looking for justice. A diary, written in 1912 by a Lutheran pastor is discovered within a wall. What it unveils is a slow massacre, a chain of events that go back to 217 Blackfeet dead in the snow. Told in transcribed interviews by a Blackfeet named Good Stab, who shares the narrative of his peculiar life over a series of confessional visits. This is an American Indian revenge story written by one of the new masters of horror, Stephen Graham Jones.",
    "pageCount": 448,
    "publishedDate": "2025-03-18",
    "genres": [
      "Fiction"
    ],
    "isbn": "9781668075104",
    "dateStarted": "2026-01-13T22:06:03.071Z",
    "format": "book"
  },
  {
    "id": "1768341388329-40uafnmhj",
    "title": "The Dog Stars",
    "author": "Peter Heller",
    "status": "want-to-read",
    "coverUrl": "http://books.google.com/books/content?id=8CdnJALnV8MC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "description": "SOON TO BE A MAJOR MOTION PICTURE • NATIONAL BESTSELLER • From the author of The River: In this \"end-of-the-world novel more like a rapturous beginning\" (San Francisco Chronicle), Hig somehow survived the flu pandemic that killed everyone he knows. His gripping story is \"an ode to friendship between two men...the strong bond between a human and a dog, and a reminder of what is worth living for\" (Minneapolis Star-Tribune). Hig's wife is gone, his friends are dead, and he lives in the hangar of a small abandoned airport with his dog, Jasper, and a mercurial, gun-toting misanthrope named Bangley. But when a random transmission beams through the radio of his 1956 Cessna, the voice ignites a hope deep inside him that a better life exists outside their tightly controlled perimeter. Risking everything, he flies past his point of no return and follows its static-broken trail, only to find something that is both better and worse than anything he could ever hope for.",
    "pageCount": 337,
    "publishedDate": "2013-05-07",
    "genres": [
      "Fiction"
    ],
    "isbn": "9780307950475",
    "format": "book"
  },
  {
    "id": "1768341388329-ebw1smt2e",
    "title": "Heartwood",
    "author": "Amity Gaige",
    "status": "want-to-read",
    "coverUrl": "http://books.google.com/books/content?id=qG5REQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "description": "\"In the heart of the Maine woods, an experienced Appalachian Trail hiker goes missing. She is forty-two-year-old Valerie Gillis, who has vanished 200 miles from her final destination. Alone in the wilderness, Valerie pours her thoughts into fractured, poetic letters to her mother as she battles the elements and struggles to keep hoping. At the heart of the investigation is Beverly, the determined Maine State Game Warden tasked with finding Valerie, who leads the search on the ground. Meanwhile, Lena, a seventy-six-year-old birdwatcher in a Connecticut retirement community, becomes an unexpected armchair detective. Roving between these compelling narratives, a puzzle emerges, intensifying the frantic search, as Valerie's disappearance may not be accidental.\"--Provided by publisher.",
    "pageCount": 320,
    "publishedDate": "2025-04",
    "genres": [
      "Fiction"
    ],
    "isbn": "9781668063606",
    "format": "book"
  },
  {
    "id": "1768341388329-j3xadrnnc",
    "title": "The Sacketts",
    "author": "Louis L'Amour",
    "status": "want-to-read",
    "coverUrl": "http://books.google.com/books/content?id=L8yOEAAAQBAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
    "description": "Three classic novels in L'Amour's beloved series featuring the Sackett familyare available for the first time on CD. Unabridged. 5 CDs.",
    "publishedDate": "2008-05-20",
    "genres": [
      "Fiction"
    ],
    "isbn": "9780739342213",
    "pageCount": 0,
    "format": "book"
  },
  {
    "id": "1768341388329-5ybh51m8f",
    "title": "Buckskin and Blanket Days",
    "author": "Thomas Henry Tibbitts",
    "status": "currently-reading",
    "publishedDate": "1958",
    "dateStarted": "2026-01-13T22:06:23.651Z",
    "format": "book"
  },
  {
    "id": "1768341388329-gnmjgn27a",
    "title": "Education of a Wandering Man",
    "author": "Louis L'Amour",
    "status": "want-to-read",
    "coverUrl": "http://books.google.com/books/content?id=x_4j_vuDHp0C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "description": "From his decision to leave school at fifteen to roam the world, to his recollections of life as a hobo on the Southern Pacific Railroad, as a cattle skinner in Texas, as a merchant seaman in Singapore and the West Indies, and as an itinerant bare-knuckled prizefighter across small-town America, here is Louis L'Amour's memoir of his lifelong love affair with learning—from books, from yondering, and from some remarkable men and women—that shaped him as a storyteller and as a man. Like classic L'Amour fiction, Education of a Wandering Man mixes authentic frontier drama--such as the author's desperate efforts to survive a sudden two-day trek across the blazing Mojave desert--with true-life characters like Shanghai waterfront toughs, desert prospectors, and cowboys whom Louis L'Amour met while traveling the globe. At last, in his own words, this is a story of a one-of-a-kind life lived to the fullest . . . a life that inspired the books that will forever enable us to relive our glorious frontier heritage.",
    "pageCount": 278,
    "publishedDate": "2008-04-29",
    "genres": [
      "Biography & Autobiography"
    ],
    "isbn": "9780553899085",
    "format": "book"
  },
  {
    "id": "1768341388329-8tm1jfro1",
    "title": "The Brave Cowboy",
    "author": "Edward Abbey",
    "status": "want-to-read",
    "coverUrl": "http://books.google.com/books/content?id=fcgpAAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "description": "A cowboy takes on the forces of twentieth century tyranny in a tale by \"the Thoreau of the American West\" that became the classic film Lonely Are the Brave (Larry McMurtry, Pulitzer Prize–winning author of Lonesome Dove). A rugged individualist and sometime ranch hand, Jack Burns has no love for the modern world. He is a man out of time, riding his horse through a Southwestern landscape corrupted by concrete, shopping centers, and superhighways. A stubborn loner, he lives by a personal moral code that often sets him at odds with contemporary society. And he wouldn't have it any other way. When Jack's brazen attempt to free a jailed friend fails, the \"anarchist cowboy\" becomes an outlaw overnight. Suddenly he and his chestnut mare are racing toward the New Mexican high country with the state police, the military, and the FBI in hot pursuit. His private war against authority has reached a dangerous new level. But if the powerful forces aligning against him think that Jack is going to go quietly, they've got another think coming. The Houston Chronicle called Edward Abbey \"a fresh breath from the farther reaches and canyons of the diminishing frontier.\" The bestselling author of The Monkey Wrench Gang delivers a stirring tribute to individualism and the vanishing American hero. Brought to the big screen in 1962 as Lonely Are the Brave—a major motion picture starring Kirk Douglas and Walter Matthau— The Brave Cowboy is a moving and thought-provoking fable of the modern American West.",
    "pageCount": 315,
    "publishedDate": "2011-08-19",
    "genres": [
      "Fiction"
    ],
    "isbn": "9780795317514",
    "format": "book"
  },
  {
    "id": "1768362079461-j2xj61gef",
    "title": "Mother of God",
    "author": "Paul Rosolie",
    "status": "want-to-read",
    "dateAdded": "2026-01-14T03:41:19.461Z",
    "coverUrl": "http://books.google.com/books/content?id=2lw6nQEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
    "description": "For fans of The Lost City of Z, Walking the Amazon, and Turn Right at Machu Picchu comes naturalist and explorer Paul Rosolie’s extraordinary adventure in the uncharted tributaries of the Western Amazon—a tale of discovery that vividly captures the awe, beauty, and isolation of this endangered land and presents an impassioned call to save it. In the Madre de Dios—Mother of God—region of Peru, where the Amazon River begins its massive flow, the Andean Mountain cloud forests fall into lowland Amazon Rainforest, creating the most biodiversity-rich place on the planet. In January 2006, when he was just a restless eighteen-year-old hungry for adventure, Paul Rosolie embarked on a journey to the west Amazon that would transform his life. Venturing alone into some of the most inaccessible reaches of the jungle, he encountered giant snakes, floating forests, isolated tribes untouched by outsiders, prowling jaguars, orphaned baby anteaters, poachers in the black market trade in endangered species, and much more. Yet today, the primordial forests of the Madre de Dios are in danger from developers, oil giants, and gold miners eager to exploit its natural resources. In Mother of God, this explorer and conservationist relives his amazing odyssey exploring the heart of this wildest place on earth. When he began delving deeper in his search for the secret Eden, spending extended periods in isolated solitude, he found things he never imagined could exist. “Alone and miniscule against a titanic landscape I have seen the depths of the Amazon, the guts of the jungle where no men go, Rosolie writes. “But as the legendary explorer Percy Fawcett warned, ‘the few remaining unknown places of the world exact a price for their secrets.’” Illustrated with 16 pages of color photos.",
    "pageCount": 0,
    "publishedDate": "2014-03-18",
    "genres": [
      "Biography & Autobiography"
    ],
    "format": "book",
    "notes": "Saw him intereviewed on Lex Friedman podcast, spoke about Cormac McCarthy as influence."
  },
  {
    "id": "1768362112090-rsjyk4kss",
    "title": "Jungle Keeper",
    "author": "Paul Rosolie",
    "status": "want-to-read",
    "dateAdded": "2026-01-14T03:41:52.090Z",
    "coverUrl": "http://books.google.com/books/content?id=FohoEQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "description": "Most people assume that the world has been explored and true adventure is dead: This book is one man’s rebuttal. Explorer and conservationist Paul Rosolie shares his incredible life in the Amazon rainforest—and what we can learn from the people fighting to protect it. “On behalf of the forests that I love, thank you, Paul, for writing this book.”—Jane Goodall Deep in the Peruvian jungle, there exists a corner of the world that remains untouched—one teeming with giant anacondas, where the haunting cries of howler monkeys send brightly colored macaws shooting across the canopy. It’s an ecosystem of stupendous biodiversity, uncontacted tribes, and adventures that most people don’t even dare to dream of. When he first set foot in the jungle, Rosolie was a dyslexic kid from Brooklyn who struggled to graduate from high school but had an undeniable calling to the outdoors. He was lucky enough to meet the indigenous naturalist Juan Julio Durand, and together, over two decades, they have created Junglekeepers, an organization that has found a way to halt deforestation and protect more than 110,000 acres—inspiring millions along the way by documenting their progress online. But this work takes grit, and years in, Rosolie and Durand are past their “barefoot machete days,” grappling with chain saws, massive fires, illegal miners, and the worst of humanity. Here, Rosolie brings you up close and personal with one of the wildest places on the planet and tells the incredible story of “first contact” with one of the most mysterious uncontacted tribes on Earth: the Mashco Piro. This book is about the profound power of saying yes: yes to one’s calling, yes to sticking with your dream when it comes at a high cost, and yes to taking a stand to save what might otherwise be gone in a generation. It’s a story of calling, connectedness, and hope.",
    "pageCount": 345,
    "publishedDate": "2026-01-20",
    "genres": [
      "Nature"
    ],
    "format": "book",
    "notes": "Saw him intereviewed on Lex Friedman podcast, spoke about Cormac McCarthy as influence."
  }
]